package com.cmy.zujuan.pojo;

import lombok.Data;

import java.util.List;

/**
 * 学段、学科、版本
 * 学段 code
 * 1 小学
 * 161 六年级上
 *
 * 2 初中
 *
 * 3 高中
 *
 * 学科 code
 * 1 语文 2 数学 3 英语
 * 4 历史 5 地理 6 政治
 * 7 生物 8 物理 9 化学
 * 版本 code
 * 40 人教版（新课程标准）
 * 81 部编版
 */

@Data
public class CurriculumItem {

    private Long id;

    private String name;

    // 连接层次结构的父标识符
    private Long pid;

    // 其他api使用的字段
    private String code;

    private List<CurriculumItem> child;

}

/**
 * 根据以下JSON编写Springboot实体类，getset方法使用@Data注解：“{
 *     "errorCode": "0",
 *     "data": [
 *       {
 *         "id": "1",
 *         "name": "小学",
 *         "pid": "0",
 *         "code": "1",
 *         "child": [
 *           {
 *             "id": "2",
 *             "name": "一年级上",
 *             "pid": "1",
 *             "code": "111",
 *             "child": []
 *           }
 *         ]
 *       },
 *       {
 *         "id": "3",
 *         "name": "小学",
 *         "pid": "0",
 *         "code": "1",
 *         "child": [
 *           {
 *             "id": "4",
 *             "name": "一年级上",
 *             "pid": "3",
 *             "code": "111",
 *             "child": [
 *               {
 *                 "id": "5",
 *                 "name": "语文",
 *                 "pid": "4",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "6",
 *                     "name": "部编版",
 *                     "pid": "5",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "7",
 *                     "name": "语文S版",
 *                     "pid": "5",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "8",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "5",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "9",
 *                     "name": "部编版五四制",
 *                     "pid": "5",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "10",
 *                 "name": "数学",
 *                 "pid": "4",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "11",
 *                     "name": "人教版",
 *                     "pid": "10",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "12",
 *                     "name": "北师大版",
 *                     "pid": "10",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "13",
 *                     "name": "冀教新版",
 *                     "pid": "10",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "14",
 *                     "name": "苏教新版",
 *                     "pid": "10",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "15",
 *                     "name": "沪教新版",
 *                     "pid": "10",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "16",
 *                     "name": "西师新版",
 *                     "pid": "10",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "17",
 *                     "name": "青岛五四制新",
 *                     "pid": "10",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "18",
 *                     "name": "青岛版六三制新",
 *                     "pid": "10",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "19",
 *                     "name": "北京新版",
 *                     "pid": "10",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "20",
 *                     "name": "人教新版",
 *                     "pid": "10",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "21",
 *                     "name": "北师大新版",
 *                     "pid": "10",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "22",
 *                 "name": "英语",
 *                 "pid": "4",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "23",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "22",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "24",
 *                     "name": "北京版",
 *                     "pid": "22",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "25",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "22",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "26",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "22",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "27",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "22",
 *                     "code": "125",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "28",
 *             "name": "一年级下",
 *             "pid": "3",
 *             "code": "112",
 *             "child": [
 *               {
 *                 "id": "29",
 *                 "name": "语文",
 *                 "pid": "28",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "30",
 *                     "name": "部编版",
 *                     "pid": "29",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "31",
 *                     "name": "苏教版",
 *                     "pid": "29",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "32",
 *                     "name": "语文S版",
 *                     "pid": "29",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "33",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "29",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "34",
 *                     "name": "部编版五四制",
 *                     "pid": "29",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "35",
 *                 "name": "数学",
 *                 "pid": "28",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "36",
 *                     "name": "人教版",
 *                     "pid": "35",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "37",
 *                     "name": "北师大版",
 *                     "pid": "35",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "38",
 *                     "name": "冀教新版",
 *                     "pid": "35",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "39",
 *                     "name": "苏教新版",
 *                     "pid": "35",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "40",
 *                     "name": "沪教新版",
 *                     "pid": "35",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "41",
 *                     "name": "西师新版",
 *                     "pid": "35",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "42",
 *                     "name": "青岛五四制新",
 *                     "pid": "35",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "43",
 *                     "name": "青岛版六三制新",
 *                     "pid": "35",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "44",
 *                     "name": "北京新版",
 *                     "pid": "35",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "45",
 *                     "name": "人教新版",
 *                     "pid": "35",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "46",
 *                     "name": "北师大新版",
 *                     "pid": "35",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "47",
 *                 "name": "英语",
 *                 "pid": "28",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "48",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "47",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "49",
 *                     "name": "北京版",
 *                     "pid": "47",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "50",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "47",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "51",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "47",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "52",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "47",
 *                     "code": "125",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "53",
 *             "name": "二年级上",
 *             "pid": "3",
 *             "code": "121",
 *             "child": [
 *               {
 *                 "id": "54",
 *                 "name": "语文",
 *                 "pid": "53",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "55",
 *                     "name": "部编版",
 *                     "pid": "54",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "56",
 *                     "name": "苏教版",
 *                     "pid": "54",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "57",
 *                     "name": "语文S版",
 *                     "pid": "54",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "58",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "54",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "59",
 *                     "name": "部编版五四制",
 *                     "pid": "54",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "60",
 *                 "name": "数学",
 *                 "pid": "53",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "61",
 *                     "name": "人教版",
 *                     "pid": "60",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "62",
 *                     "name": "北师大版",
 *                     "pid": "60",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "63",
 *                     "name": "冀教新版",
 *                     "pid": "60",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "64",
 *                     "name": "苏教新版",
 *                     "pid": "60",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "65",
 *                     "name": "沪教新版",
 *                     "pid": "60",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "66",
 *                     "name": "西师新版",
 *                     "pid": "60",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "67",
 *                     "name": "青岛五四制新",
 *                     "pid": "60",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "68",
 *                     "name": "青岛版六三制新",
 *                     "pid": "60",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "69",
 *                     "name": "北京新版",
 *                     "pid": "60",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "70",
 *                     "name": "人教新版",
 *                     "pid": "60",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "71",
 *                     "name": "北师大新版",
 *                     "pid": "60",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "72",
 *                 "name": "英语",
 *                 "pid": "53",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "73",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "72",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "74",
 *                     "name": "北京版",
 *                     "pid": "72",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "75",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "72",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "76",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "72",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "77",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "72",
 *                     "code": "125",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "78",
 *             "name": "二年级下",
 *             "pid": "3",
 *             "code": "122",
 *             "child": [
 *               {
 *                 "id": "79",
 *                 "name": "语文",
 *                 "pid": "78",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "80",
 *                     "name": "部编版",
 *                     "pid": "79",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "81",
 *                     "name": "苏教版",
 *                     "pid": "79",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "82",
 *                     "name": "语文S版",
 *                     "pid": "79",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "83",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "79",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "84",
 *                     "name": "部编版五四制",
 *                     "pid": "79",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "85",
 *                 "name": "数学",
 *                 "pid": "78",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "86",
 *                     "name": "人教版",
 *                     "pid": "85",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "87",
 *                     "name": "北师大版",
 *                     "pid": "85",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "88",
 *                     "name": "冀教新版",
 *                     "pid": "85",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "89",
 *                     "name": "苏教新版",
 *                     "pid": "85",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "90",
 *                     "name": "沪教新版",
 *                     "pid": "85",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "91",
 *                     "name": "西师新版",
 *                     "pid": "85",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "92",
 *                     "name": "青岛五四制新",
 *                     "pid": "85",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "93",
 *                     "name": "青岛版六三制新",
 *                     "pid": "85",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "94",
 *                     "name": "北京新版",
 *                     "pid": "85",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "95",
 *                     "name": "人教新版",
 *                     "pid": "85",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "96",
 *                     "name": "北师大新版",
 *                     "pid": "85",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "97",
 *                 "name": "英语",
 *                 "pid": "78",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "98",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "97",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "99",
 *                     "name": "北京版",
 *                     "pid": "97",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "100",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "97",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "101",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "97",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "102",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "97",
 *                     "code": "125",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "103",
 *             "name": "三年级上",
 *             "pid": "3",
 *             "code": "131",
 *             "child": [
 *               {
 *                 "id": "104",
 *                 "name": "数学",
 *                 "pid": "103",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "105",
 *                     "name": "苏教新版",
 *                     "pid": "104",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "106",
 *                     "name": "冀教新版",
 *                     "pid": "104",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "107",
 *                     "name": "青岛版六三制新",
 *                     "pid": "104",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "108",
 *                     "name": "西师新版",
 *                     "pid": "104",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "109",
 *                     "name": "青岛五四制新",
 *                     "pid": "104",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "110",
 *                     "name": "沪教新版",
 *                     "pid": "104",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "111",
 *                     "name": "人教版",
 *                     "pid": "104",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "112",
 *                     "name": "北师大版",
 *                     "pid": "104",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "113",
 *                     "name": "苏教版",
 *                     "pid": "104",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "114",
 *                     "name": "西师版",
 *                     "pid": "104",
 *                     "code": "2",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "115",
 *                     "name": "北京版",
 *                     "pid": "104",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "116",
 *                     "name": "浙教版",
 *                     "pid": "104",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "117",
 *                     "name": "北京新版",
 *                     "pid": "104",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "118",
 *                     "name": "人教新版",
 *                     "pid": "104",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "119",
 *                     "name": "北师大新版",
 *                     "pid": "104",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "120",
 *                 "name": "语文",
 *                 "pid": "103",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "121",
 *                     "name": "部编版",
 *                     "pid": "120",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "122",
 *                     "name": "苏教版",
 *                     "pid": "120",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "123",
 *                     "name": "语文S版",
 *                     "pid": "120",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "124",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "120",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "125",
 *                     "name": "北师大版",
 *                     "pid": "120",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "126",
 *                     "name": "部编版五四制",
 *                     "pid": "120",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "127",
 *                 "name": "英语",
 *                 "pid": "103",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "128",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "127",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "129",
 *                     "name": "人教版(PEP)",
 *                     "pid": "127",
 *                     "code": "45",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "130",
 *                     "name": "外研版(三年级起点)",
 *                     "pid": "127",
 *                     "code": "44",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "131",
 *                     "name": "北京版",
 *                     "pid": "127",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "132",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "127",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "133",
 *                     "name": "冀教版(三年级起点)",
 *                     "pid": "127",
 *                     "code": "109",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "134",
 *                     "name": "教科版（广州）",
 *                     "pid": "127",
 *                     "code": "110",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "135",
 *                     "name": "科普版",
 *                     "pid": "127",
 *                     "code": "111",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "136",
 *                     "name": "闽教版(三年级起点)",
 *                     "pid": "127",
 *                     "code": "112",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "137",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "127",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "138",
 *                     "name": "人教版(新起点)",
 *                     "pid": "127",
 *                     "code": "114",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "139",
 *                     "name": "人教精通版（三年级起点）",
 *                     "pid": "127",
 *                     "code": "115",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "140",
 *                     "name": "陕旅版(三年级起点)",
 *                     "pid": "127",
 *                     "code": "116",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "141",
 *                     "name": "外研剑桥版（刘兆义主编）",
 *                     "pid": "127",
 *                     "code": "117",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "142",
 *                     "name": "湘少版",
 *                     "pid": "127",
 *                     "code": "118",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "143",
 *                     "name": "新版-牛津译林版",
 *                     "pid": "127",
 *                     "code": "119",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "144",
 *                     "name": "接力版(三年级起点)",
 *                     "pid": "127",
 *                     "code": "123",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "145",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "127",
 *                     "code": "125",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "146",
 *                     "name": "北师大版（三年级起点）",
 *                     "pid": "127",
 *                     "code": "128",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "147",
 *             "name": "三年级下",
 *             "pid": "3",
 *             "code": "132",
 *             "child": [
 *               {
 *                 "id": "148",
 *                 "name": "数学",
 *                 "pid": "147",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "149",
 *                     "name": "苏教新版",
 *                     "pid": "148",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "150",
 *                     "name": "青岛版六三制新",
 *                     "pid": "148",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "151",
 *                     "name": "西师新版",
 *                     "pid": "148",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "152",
 *                     "name": "青岛五四制新",
 *                     "pid": "148",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "153",
 *                     "name": "沪教新版",
 *                     "pid": "148",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "154",
 *                     "name": "冀教新版",
 *                     "pid": "148",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "155",
 *                     "name": "人教版",
 *                     "pid": "148",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "156",
 *                     "name": "北师大版",
 *                     "pid": "148",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "157",
 *                     "name": "苏教版",
 *                     "pid": "148",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "158",
 *                     "name": "西师版",
 *                     "pid": "148",
 *                     "code": "2",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "159",
 *                     "name": "北京版",
 *                     "pid": "148",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "160",
 *                     "name": "浙教版",
 *                     "pid": "148",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "161",
 *                     "name": "北京新版",
 *                     "pid": "148",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "162",
 *                     "name": "人教新版",
 *                     "pid": "148",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "163",
 *                     "name": "北师大新版",
 *                     "pid": "148",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "164",
 *                 "name": "语文",
 *                 "pid": "147",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "165",
 *                     "name": "部编版",
 *                     "pid": "164",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "166",
 *                     "name": "苏教版",
 *                     "pid": "164",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "167",
 *                     "name": "语文S版",
 *                     "pid": "164",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "168",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "164",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "169",
 *                     "name": "北师大版",
 *                     "pid": "164",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "170",
 *                     "name": "部编版五四制",
 *                     "pid": "164",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "171",
 *                 "name": "英语",
 *                 "pid": "147",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "172",
 *                     "name": "人教版(PEP)",
 *                     "pid": "171",
 *                     "code": "45",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "173",
 *                     "name": "外研版(三年级起点)",
 *                     "pid": "171",
 *                     "code": "44",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "174",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "171",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "175",
 *                     "name": "北京版",
 *                     "pid": "171",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "176",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "171",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "177",
 *                     "name": "冀教版(三年级起点)",
 *                     "pid": "171",
 *                     "code": "109",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "178",
 *                     "name": "教科版（广州）",
 *                     "pid": "171",
 *                     "code": "110",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "179",
 *                     "name": "科普版",
 *                     "pid": "171",
 *                     "code": "111",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "180",
 *                     "name": "闽教版(三年级起点)",
 *                     "pid": "171",
 *                     "code": "112",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "181",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "171",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "182",
 *                     "name": "人教版(新起点)",
 *                     "pid": "171",
 *                     "code": "114",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "183",
 *                     "name": "人教精通版（三年级起点）",
 *                     "pid": "171",
 *                     "code": "115",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "184",
 *                     "name": "陕旅版(三年级起点)",
 *                     "pid": "171",
 *                     "code": "116",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "185",
 *                     "name": "外研剑桥版（刘兆义主编）",
 *                     "pid": "171",
 *                     "code": "117",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "186",
 *                     "name": "湘少版",
 *                     "pid": "171",
 *                     "code": "118",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "187",
 *                     "name": "新版-牛津译林版",
 *                     "pid": "171",
 *                     "code": "119",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "188",
 *                     "name": "广东版(先锋、开心)",
 *                     "pid": "171",
 *                     "code": "122",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "189",
 *                     "name": "接力版(三年级起点)",
 *                     "pid": "171",
 *                     "code": "123",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "190",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "171",
 *                     "code": "125",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "191",
 *                     "name": "北师大版（三年级起点）",
 *                     "pid": "171",
 *                     "code": "128",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "192",
 *             "name": "四年级上",
 *             "pid": "3",
 *             "code": "141",
 *             "child": [
 *               {
 *                 "id": "193",
 *                 "name": "数学",
 *                 "pid": "192",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "194",
 *                     "name": "苏教新版",
 *                     "pid": "193",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "195",
 *                     "name": "冀教新版",
 *                     "pid": "193",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "196",
 *                     "name": "青岛版六三制新",
 *                     "pid": "193",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "197",
 *                     "name": "西师新版",
 *                     "pid": "193",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "198",
 *                     "name": "青岛五四制新",
 *                     "pid": "193",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "199",
 *                     "name": "沪教新版",
 *                     "pid": "193",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "200",
 *                     "name": "人教版",
 *                     "pid": "193",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "201",
 *                     "name": "北师大版",
 *                     "pid": "193",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "202",
 *                     "name": "苏教版",
 *                     "pid": "193",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "203",
 *                     "name": "西师版",
 *                     "pid": "193",
 *                     "code": "2",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "204",
 *                     "name": "北京版",
 *                     "pid": "193",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "205",
 *                     "name": "浙教版",
 *                     "pid": "193",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "206",
 *                     "name": "北京新版",
 *                     "pid": "193",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "207",
 *                     "name": "人教新版",
 *                     "pid": "193",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "208",
 *                     "name": "北师大新版",
 *                     "pid": "193",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "209",
 *                 "name": "语文",
 *                 "pid": "192",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "210",
 *                     "name": "部编版",
 *                     "pid": "209",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "211",
 *                     "name": "苏教版",
 *                     "pid": "209",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "212",
 *                     "name": "语文S版",
 *                     "pid": "209",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "213",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "209",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "214",
 *                     "name": "北师大版",
 *                     "pid": "209",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "215",
 *                     "name": "部编版五四制",
 *                     "pid": "209",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "216",
 *                 "name": "英语",
 *                 "pid": "192",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "217",
 *                     "name": "人教版(PEP)",
 *                     "pid": "216",
 *                     "code": "45",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "218",
 *                     "name": "外研版(三年级起点)",
 *                     "pid": "216",
 *                     "code": "44",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "219",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "216",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "220",
 *                     "name": "北京版",
 *                     "pid": "216",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "221",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "216",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "222",
 *                     "name": "冀教版(三年级起点)",
 *                     "pid": "216",
 *                     "code": "109",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "223",
 *                     "name": "教科版（广州）",
 *                     "pid": "216",
 *                     "code": "110",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "224",
 *                     "name": "科普版",
 *                     "pid": "216",
 *                     "code": "111",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "225",
 *                     "name": "闽教版(三年级起点)",
 *                     "pid": "216",
 *                     "code": "112",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "226",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "216",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "227",
 *                     "name": "人教版(新起点)",
 *                     "pid": "216",
 *                     "code": "114",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "228",
 *                     "name": "人教精通版（三年级起点）",
 *                     "pid": "216",
 *                     "code": "115",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "229",
 *                     "name": "陕旅版(三年级起点)",
 *                     "pid": "216",
 *                     "code": "116",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "230",
 *                     "name": "外研剑桥版（刘兆义主编）",
 *                     "pid": "216",
 *                     "code": "117",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "231",
 *                     "name": "湘少版",
 *                     "pid": "216",
 *                     "code": "118",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "232",
 *                     "name": "新版-牛津译林版",
 *                     "pid": "216",
 *                     "code": "119",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "233",
 *                     "name": "接力版(三年级起点)",
 *                     "pid": "216",
 *                     "code": "123",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "234",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "216",
 *                     "code": "125",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "235",
 *                     "name": "北师大版（三年级起点）",
 *                     "pid": "216",
 *                     "code": "128",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "236",
 *             "name": "四年级下",
 *             "pid": "3",
 *             "code": "142",
 *             "child": [
 *               {
 *                 "id": "237",
 *                 "name": "数学",
 *                 "pid": "236",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "238",
 *                     "name": "苏教新版",
 *                     "pid": "237",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "239",
 *                     "name": "青岛版六三制新",
 *                     "pid": "237",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "240",
 *                     "name": "西师新版",
 *                     "pid": "237",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "241",
 *                     "name": "青岛五四制新",
 *                     "pid": "237",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "242",
 *                     "name": "沪教新版",
 *                     "pid": "237",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "243",
 *                     "name": "冀教新版",
 *                     "pid": "237",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "244",
 *                     "name": "人教版",
 *                     "pid": "237",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "245",
 *                     "name": "北师大版",
 *                     "pid": "237",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "246",
 *                     "name": "苏教版",
 *                     "pid": "237",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "247",
 *                     "name": "西师版",
 *                     "pid": "237",
 *                     "code": "2",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "248",
 *                     "name": "北京版",
 *                     "pid": "237",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "249",
 *                     "name": "浙教版",
 *                     "pid": "237",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "250",
 *                     "name": "北京新版",
 *                     "pid": "237",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "251",
 *                     "name": "人教新版",
 *                     "pid": "237",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "252",
 *                     "name": "北师大新版",
 *                     "pid": "237",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "253",
 *                 "name": "英语",
 *                 "pid": "236",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "254",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "253",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "255",
 *                     "name": "人教版(PEP)",
 *                     "pid": "253",
 *                     "code": "45",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "256",
 *                     "name": "外研版(三年级起点)",
 *                     "pid": "253",
 *                     "code": "44",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "257",
 *                     "name": "北京版",
 *                     "pid": "253",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "258",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "253",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "259",
 *                     "name": "冀教版(三年级起点)",
 *                     "pid": "253",
 *                     "code": "109",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "260",
 *                     "name": "教科版（广州）",
 *                     "pid": "253",
 *                     "code": "110",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "261",
 *                     "name": "科普版",
 *                     "pid": "253",
 *                     "code": "111",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "262",
 *                     "name": "闽教版(三年级起点)",
 *                     "pid": "253",
 *                     "code": "112",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "263",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "253",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "264",
 *                     "name": "人教版(新起点)",
 *                     "pid": "253",
 *                     "code": "114",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "265",
 *                     "name": "人教精通版（三年级起点）",
 *                     "pid": "253",
 *                     "code": "115",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "266",
 *                     "name": "陕旅版(三年级起点)",
 *                     "pid": "253",
 *                     "code": "116",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "267",
 *                     "name": "外研剑桥版（刘兆义主编）",
 *                     "pid": "253",
 *                     "code": "117",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "268",
 *                     "name": "湘少版",
 *                     "pid": "253",
 *                     "code": "118",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "269",
 *                     "name": "新版-牛津译林版",
 *                     "pid": "253",
 *                     "code": "119",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "270",
 *                     "name": "广东版(先锋、开心)",
 *                     "pid": "253",
 *                     "code": "122",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "271",
 *                     "name": "接力版(三年级起点)",
 *                     "pid": "253",
 *                     "code": "123",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "272",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "253",
 *                     "code": "125",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "273",
 *                     "name": "北师大版（三年级起点）",
 *                     "pid": "253",
 *                     "code": "128",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "274",
 *                 "name": "语文",
 *                 "pid": "236",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "275",
 *                     "name": "苏教版",
 *                     "pid": "274",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "276",
 *                     "name": "语文S版",
 *                     "pid": "274",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "277",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "274",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "278",
 *                     "name": "北师大版",
 *                     "pid": "274",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "279",
 *                     "name": "部编版",
 *                     "pid": "274",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "280",
 *                     "name": "部编版五四制",
 *                     "pid": "274",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "281",
 *             "name": "五年级上",
 *             "pid": "3",
 *             "code": "151",
 *             "child": [
 *               {
 *                 "id": "282",
 *                 "name": "数学",
 *                 "pid": "281",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "283",
 *                     "name": "苏教新版",
 *                     "pid": "282",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "284",
 *                     "name": "冀教新版",
 *                     "pid": "282",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "285",
 *                     "name": "青岛版六三制新",
 *                     "pid": "282",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "286",
 *                     "name": "西师新版",
 *                     "pid": "282",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "287",
 *                     "name": "青岛五四制新",
 *                     "pid": "282",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "288",
 *                     "name": "沪教新版",
 *                     "pid": "282",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "289",
 *                     "name": "人教版",
 *                     "pid": "282",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "290",
 *                     "name": "北师大版",
 *                     "pid": "282",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "291",
 *                     "name": "苏教版",
 *                     "pid": "282",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "292",
 *                     "name": "西师版",
 *                     "pid": "282",
 *                     "code": "2",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "293",
 *                     "name": "北京版",
 *                     "pid": "282",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "294",
 *                     "name": "浙教版",
 *                     "pid": "282",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "295",
 *                     "name": "北京新版",
 *                     "pid": "282",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "296",
 *                     "name": "人教新版",
 *                     "pid": "282",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "297",
 *                     "name": "北师大新版",
 *                     "pid": "282",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "298",
 *                 "name": "语文",
 *                 "pid": "281",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "299",
 *                     "name": "部编版",
 *                     "pid": "298",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "300",
 *                     "name": "苏教版",
 *                     "pid": "298",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "301",
 *                     "name": "语文S版",
 *                     "pid": "298",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "302",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "298",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "303",
 *                     "name": "北师大版",
 *                     "pid": "298",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "304",
 *                     "name": "部编版五四制",
 *                     "pid": "298",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "305",
 *                 "name": "英语",
 *                 "pid": "281",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "306",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "305",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "307",
 *                     "name": "人教版(PEP)",
 *                     "pid": "305",
 *                     "code": "45",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "308",
 *                     "name": "外研版(三年级起点)",
 *                     "pid": "305",
 *                     "code": "44",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "309",
 *                     "name": "北京版",
 *                     "pid": "305",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "310",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "305",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "311",
 *                     "name": "冀教版(三年级起点)",
 *                     "pid": "305",
 *                     "code": "109",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "312",
 *                     "name": "教科版（广州）",
 *                     "pid": "305",
 *                     "code": "110",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "313",
 *                     "name": "科普版",
 *                     "pid": "305",
 *                     "code": "111",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "314",
 *                     "name": "闽教版(三年级起点)",
 *                     "pid": "305",
 *                     "code": "112",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "315",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "305",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "316",
 *                     "name": "人教版(新起点)",
 *                     "pid": "305",
 *                     "code": "114",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "317",
 *                     "name": "人教精通版（三年级起点）",
 *                     "pid": "305",
 *                     "code": "115",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "318",
 *                     "name": "陕旅版(三年级起点)",
 *                     "pid": "305",
 *                     "code": "116",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "319",
 *                     "name": "外研剑桥版（刘兆义主编）",
 *                     "pid": "305",
 *                     "code": "117",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "320",
 *                     "name": "湘少版",
 *                     "pid": "305",
 *                     "code": "118",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "321",
 *                     "name": "新版-牛津译林版",
 *                     "pid": "305",
 *                     "code": "119",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "322",
 *                     "name": "深港朗文版",
 *                     "pid": "305",
 *                     "code": "124",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "323",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "305",
 *                     "code": "125",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "324",
 *                     "name": "北师大版（三年级起点）",
 *                     "pid": "305",
 *                     "code": "128",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "325",
 *             "name": "五年级下",
 *             "pid": "3",
 *             "code": "152",
 *             "child": [
 *               {
 *                 "id": "326",
 *                 "name": "数学",
 *                 "pid": "325",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "327",
 *                     "name": "苏教新版",
 *                     "pid": "326",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "328",
 *                     "name": "冀教新版",
 *                     "pid": "326",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "329",
 *                     "name": "青岛版六三制新",
 *                     "pid": "326",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "330",
 *                     "name": "西师新版",
 *                     "pid": "326",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "331",
 *                     "name": "青岛五四制新",
 *                     "pid": "326",
 *                     "code": "58",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "332",
 *                     "name": "沪教新版",
 *                     "pid": "326",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "333",
 *                     "name": "北师大版",
 *                     "pid": "326",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "334",
 *                     "name": "人教版",
 *                     "pid": "326",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "335",
 *                     "name": "苏教版",
 *                     "pid": "326",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "336",
 *                     "name": "西师版",
 *                     "pid": "326",
 *                     "code": "2",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "337",
 *                     "name": "北京版",
 *                     "pid": "326",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "338",
 *                     "name": "浙教版",
 *                     "pid": "326",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "339",
 *                     "name": "北京新版",
 *                     "pid": "326",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "340",
 *                     "name": "人教新版",
 *                     "pid": "326",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "341",
 *                     "name": "北师大新版",
 *                     "pid": "326",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "342",
 *                 "name": "英语",
 *                 "pid": "325",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "343",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "342",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "344",
 *                     "name": "人教版(PEP)",
 *                     "pid": "342",
 *                     "code": "45",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "345",
 *                     "name": "外研版(三年级起点)",
 *                     "pid": "342",
 *                     "code": "44",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "346",
 *                     "name": "北京版",
 *                     "pid": "342",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "347",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "342",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "348",
 *                     "name": "冀教版(三年级起点)",
 *                     "pid": "342",
 *                     "code": "109",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "349",
 *                     "name": "教科版（广州）",
 *                     "pid": "342",
 *                     "code": "110",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "350",
 *                     "name": "科普版",
 *                     "pid": "342",
 *                     "code": "111",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "351",
 *                     "name": "牛津上海版（试用本）",
 *                     "pid": "342",
 *                     "code": "113",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "352",
 *                     "name": "人教版(新起点)",
 *                     "pid": "342",
 *                     "code": "114",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "353",
 *                     "name": "人教精通版（三年级起点）",
 *                     "pid": "342",
 *                     "code": "115",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "354",
 *                     "name": "陕旅版(三年级起点)",
 *                     "pid": "342",
 *                     "code": "116",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "355",
 *                     "name": "外研剑桥版（刘兆义主编）",
 *                     "pid": "342",
 *                     "code": "117",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "356",
 *                     "name": "湘少版",
 *                     "pid": "342",
 *                     "code": "118",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "357",
 *                     "name": "新版-牛津译林版",
 *                     "pid": "342",
 *                     "code": "119",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "358",
 *                     "name": "广东版(先锋、开心)",
 *                     "pid": "342",
 *                     "code": "122",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "359",
 *                     "name": "深港朗文版",
 *                     "pid": "342",
 *                     "code": "124",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "360",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "342",
 *                     "code": "125",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "361",
 *                     "name": "北师大版（三年级起点）",
 *                     "pid": "342",
 *                     "code": "128",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "362",
 *                 "name": "语文",
 *                 "pid": "325",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "363",
 *                     "name": "苏教版",
 *                     "pid": "362",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "364",
 *                     "name": "语文S版",
 *                     "pid": "362",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "365",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "362",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "366",
 *                     "name": "北师大版",
 *                     "pid": "362",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "367",
 *                     "name": "部编版",
 *                     "pid": "362",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "368",
 *                     "name": "部编版五四制",
 *                     "pid": "362",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "369",
 *             "name": "六年级上",
 *             "pid": "3",
 *             "code": "161",
 *             "child": [
 *               {
 *                 "id": "370",
 *                 "name": "数学",
 *                 "pid": "369",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "371",
 *                     "name": "苏教新版",
 *                     "pid": "370",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "372",
 *                     "name": "冀教新版",
 *                     "pid": "370",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "373",
 *                     "name": "西师新版",
 *                     "pid": "370",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "374",
 *                     "name": "青岛版六三制新",
 *                     "pid": "370",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "375",
 *                     "name": "沪教新版",
 *                     "pid": "370",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "376",
 *                     "name": "北师大版",
 *                     "pid": "370",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "377",
 *                     "name": "人教版",
 *                     "pid": "370",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "378",
 *                     "name": "苏教版",
 *                     "pid": "370",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "379",
 *                     "name": "西师版",
 *                     "pid": "370",
 *                     "code": "2",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "380",
 *                     "name": "北京版",
 *                     "pid": "370",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "381",
 *                     "name": "浙教版",
 *                     "pid": "370",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "382",
 *                     "name": "北京新版",
 *                     "pid": "370",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "383",
 *                     "name": "人教新版",
 *                     "pid": "370",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "384",
 *                     "name": "北师大新版",
 *                     "pid": "370",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "385",
 *                 "name": "语文",
 *                 "pid": "369",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "386",
 *                     "name": "部编版",
 *                     "pid": "385",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "387",
 *                     "name": "苏教版",
 *                     "pid": "385",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "388",
 *                     "name": "语文S版",
 *                     "pid": "385",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "389",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "385",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "390",
 *                     "name": "北师大版",
 *                     "pid": "385",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "391",
 *                 "name": "英语",
 *                 "pid": "369",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "392",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "391",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "393",
 *                     "name": "人教版(PEP)",
 *                     "pid": "391",
 *                     "code": "45",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "394",
 *                     "name": "外研版(三年级起点)",
 *                     "pid": "391",
 *                     "code": "44",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "395",
 *                     "name": "北京版",
 *                     "pid": "391",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "396",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "391",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "397",
 *                     "name": "冀教版(三年级起点)",
 *                     "pid": "391",
 *                     "code": "109",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "398",
 *                     "name": "教科版（广州）",
 *                     "pid": "391",
 *                     "code": "110",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "399",
 *                     "name": "科普版",
 *                     "pid": "391",
 *                     "code": "111",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "400",
 *                     "name": "闽教版(三年级起点)",
 *                     "pid": "391",
 *                     "code": "112",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "401",
 *                     "name": "人教版(新起点)",
 *                     "pid": "391",
 *                     "code": "114",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "402",
 *                     "name": "人教精通版（三年级起点）",
 *                     "pid": "391",
 *                     "code": "115",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "403",
 *                     "name": "陕旅版(三年级起点)",
 *                     "pid": "391",
 *                     "code": "116",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "404",
 *                     "name": "外研剑桥版（刘兆义主编）",
 *                     "pid": "391",
 *                     "code": "117",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "405",
 *                     "name": "湘少版",
 *                     "pid": "391",
 *                     "code": "118",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "406",
 *                     "name": "新版-牛津译林版",
 *                     "pid": "391",
 *                     "code": "119",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "407",
 *                     "name": "深港朗文版",
 *                     "pid": "391",
 *                     "code": "124",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "408",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "391",
 *                     "code": "125",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "409",
 *                     "name": "北师大版（三年级起点）",
 *                     "pid": "391",
 *                     "code": "128",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "410",
 *             "name": "六年级下",
 *             "pid": "3",
 *             "code": "162",
 *             "child": [
 *               {
 *                 "id": "411",
 *                 "name": "数学",
 *                 "pid": "410",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "412",
 *                     "name": "苏教新版",
 *                     "pid": "411",
 *                     "code": "60",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "413",
 *                     "name": "冀教新版",
 *                     "pid": "411",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "414",
 *                     "name": "青岛版六三制新",
 *                     "pid": "411",
 *                     "code": "57",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "415",
 *                     "name": "西师新版",
 *                     "pid": "411",
 *                     "code": "61",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "416",
 *                     "name": "沪教新版",
 *                     "pid": "411",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "417",
 *                     "name": "北师大版",
 *                     "pid": "411",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "418",
 *                     "name": "人教版",
 *                     "pid": "411",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "419",
 *                     "name": "苏教版",
 *                     "pid": "411",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "420",
 *                     "name": "西师版",
 *                     "pid": "411",
 *                     "code": "2",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "421",
 *                     "name": "北京版",
 *                     "pid": "411",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "422",
 *                     "name": "浙教版",
 *                     "pid": "411",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "423",
 *                     "name": "北京新版",
 *                     "pid": "411",
 *                     "code": "134",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "424",
 *                     "name": "人教新版",
 *                     "pid": "411",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "425",
 *                     "name": "北师大新版",
 *                     "pid": "411",
 *                     "code": "55",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "426",
 *                 "name": "英语",
 *                 "pid": "410",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "427",
 *                     "name": "外研版(三年级起点)",
 *                     "pid": "426",
 *                     "code": "44",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "428",
 *                     "name": "人教版(PEP)",
 *                     "pid": "426",
 *                     "code": "45",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "429",
 *                     "name": "北京版",
 *                     "pid": "426",
 *                     "code": "13",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "430",
 *                     "name": "北师大版(一年级起点)",
 *                     "pid": "426",
 *                     "code": "108",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "431",
 *                     "name": "冀教版(三年级起点)",
 *                     "pid": "426",
 *                     "code": "109",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "432",
 *                     "name": "教科版（广州）",
 *                     "pid": "426",
 *                     "code": "110",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "433",
 *                     "name": "科普版",
 *                     "pid": "426",
 *                     "code": "111",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "434",
 *                     "name": "闽教版(三年级起点)",
 *                     "pid": "426",
 *                     "code": "112",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "435",
 *                     "name": "人教版(新起点)",
 *                     "pid": "426",
 *                     "code": "114",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "436",
 *                     "name": "人教精通版（三年级起点）",
 *                     "pid": "426",
 *                     "code": "115",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "437",
 *                     "name": "陕旅版(三年级起点)",
 *                     "pid": "426",
 *                     "code": "116",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "438",
 *                     "name": "外研剑桥版（刘兆义主编）",
 *                     "pid": "426",
 *                     "code": "117",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "439",
 *                     "name": "湘少版",
 *                     "pid": "426",
 *                     "code": "118",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "440",
 *                     "name": "新版-牛津译林版",
 *                     "pid": "426",
 *                     "code": "119",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "441",
 *                     "name": "新版-牛津上海版（深圳用）",
 *                     "pid": "426",
 *                     "code": "43",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "442",
 *                     "name": "广东版(先锋、开心)",
 *                     "pid": "426",
 *                     "code": "122",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "443",
 *                     "name": "深港朗文版",
 *                     "pid": "426",
 *                     "code": "124",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "444",
 *                     "name": "外研版(一年级起点)",
 *                     "pid": "426",
 *                     "code": "125",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "445",
 *                     "name": "北师大版（三年级起点）",
 *                     "pid": "426",
 *                     "code": "128",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "446",
 *                 "name": "语文",
 *                 "pid": "410",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "447",
 *                     "name": "苏教版",
 *                     "pid": "446",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "448",
 *                     "name": "语文S版",
 *                     "pid": "446",
 *                     "code": "38",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "449",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "446",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "450",
 *                     "name": "北师大版",
 *                     "pid": "446",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "451",
 *                     "name": "部编版",
 *                     "pid": "446",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           }
 *         ]
 *       },
 *       {
 *         "id": "452",
 *         "name": "初中",
 *         "pid": "0",
 *         "code": "2",
 *         "child": [
 *           {
 *             "id": "453",
 *             "name": "六年级上",
 *             "pid": "452",
 *             "code": "161",
 *             "child": [
 *               {
 *                 "id": "454",
 *                 "name": "数学",
 *                 "pid": "453",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "455",
 *                     "name": "鲁教五四新版",
 *                     "pid": "454",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "456",
 *                     "name": "沪教新版",
 *                     "pid": "454",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "457",
 *                     "name": "人教五四新版",
 *                     "pid": "454",
 *                     "code": "66",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "458",
 *                 "name": "地理",
 *                 "pid": "453",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "459",
 *                     "name": "鲁教五四新版",
 *                     "pid": "458",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "460",
 *                     "name": "沪教版",
 *                     "pid": "458",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "461",
 *                 "name": "生物",
 *                 "pid": "453",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "462",
 *                     "name": "鲁科五四新版",
 *                     "pid": "461",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "463",
 *                     "name": "鲁教五四版",
 *                     "pid": "461",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "464",
 *                     "name": "鲁教五四新版",
 *                     "pid": "461",
 *                     "code": "64",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "465",
 *                 "name": "历史",
 *                 "pid": "453",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "466",
 *                     "name": "部编版五四制",
 *                     "pid": "465",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "467",
 *                 "name": "道德与法治",
 *                 "pid": "453",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "468",
 *                     "name": "部编版五四制",
 *                     "pid": "467",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "469",
 *                     "name": "沪教版",
 *                     "pid": "467",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "470",
 *                 "name": "英语",
 *                 "pid": "453",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "471",
 *                     "name": "鲁教五四新版",
 *                     "pid": "470",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "472",
 *                     "name": "牛津上海（本地版）五四制",
 *                     "pid": "470",
 *                     "code": "120",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "473",
 *                     "name": "人教五四版",
 *                     "pid": "470",
 *                     "code": "94",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "474",
 *                 "name": "语文",
 *                 "pid": "453",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "475",
 *                     "name": "部编版五四制",
 *                     "pid": "474",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "476",
 *             "name": "六年级下",
 *             "pid": "452",
 *             "code": "162",
 *             "child": [
 *               {
 *                 "id": "477",
 *                 "name": "数学",
 *                 "pid": "476",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "478",
 *                     "name": "鲁教五四新版",
 *                     "pid": "477",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "479",
 *                     "name": "沪教新版",
 *                     "pid": "477",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "480",
 *                     "name": "人教五四新版",
 *                     "pid": "477",
 *                     "code": "66",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "481",
 *                 "name": "地理",
 *                 "pid": "476",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "482",
 *                     "name": "鲁教五四新版",
 *                     "pid": "481",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "483",
 *                     "name": "沪教版",
 *                     "pid": "481",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "484",
 *                 "name": "生物",
 *                 "pid": "476",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "485",
 *                     "name": "鲁科五四新版",
 *                     "pid": "484",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "486",
 *                     "name": "鲁教五四版",
 *                     "pid": "484",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "487",
 *                     "name": "鲁教五四新版",
 *                     "pid": "484",
 *                     "code": "64",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "488",
 *                 "name": "历史",
 *                 "pid": "476",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "489",
 *                     "name": "部编版五四制",
 *                     "pid": "488",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "490",
 *                 "name": "英语",
 *                 "pid": "476",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "491",
 *                     "name": "鲁教五四新版",
 *                     "pid": "490",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "492",
 *                     "name": "牛津上海（本地版）五四制",
 *                     "pid": "490",
 *                     "code": "120",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "493",
 *                     "name": "人教五四版",
 *                     "pid": "490",
 *                     "code": "94",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "494",
 *                 "name": "道德与法治",
 *                 "pid": "476",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "495",
 *                     "name": "沪教版",
 *                     "pid": "494",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "496",
 *                 "name": "语文",
 *                 "pid": "476",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "497",
 *                     "name": "部编版五四制",
 *                     "pid": "496",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "498",
 *             "name": "七年级上",
 *             "pid": "452",
 *             "code": "201",
 *             "child": [
 *               {
 *                 "id": "499",
 *                 "name": "历史",
 *                 "pid": "498",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "500",
 *                     "name": "部编版",
 *                     "pid": "499",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "501",
 *                     "name": "人教版",
 *                     "pid": "499",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "502",
 *                     "name": "北师大版",
 *                     "pid": "499",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "503",
 *                     "name": "部编版五四制",
 *                     "pid": "499",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "504",
 *                     "name": "川教版",
 *                     "pid": "499",
 *                     "code": "35",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "505",
 *                     "name": "华师大版",
 *                     "pid": "499",
 *                     "code": "29",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "506",
 *                     "name": "冀教版",
 *                     "pid": "499",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "507",
 *                     "name": "岳麓版",
 *                     "pid": "499",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "508",
 *                     "name": "中华书局版",
 *                     "pid": "499",
 *                     "code": "101",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "509",
 *                     "name": "中图版",
 *                     "pid": "499",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "510",
 *                 "name": "道德与法治",
 *                 "pid": "498",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "511",
 *                     "name": "部编版",
 *                     "pid": "510",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "512",
 *                     "name": "人教版",
 *                     "pid": "510",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "513",
 *                     "name": "部编版五四制",
 *                     "pid": "510",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "514",
 *                     "name": "粤教版",
 *                     "pid": "510",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "515",
 *                     "name": "粤教新版",
 *                     "pid": "510",
 *                     "code": "72",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "516",
 *                     "name": "北师大版",
 *                     "pid": "510",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "517",
 *                     "name": "北师大新版",
 *                     "pid": "510",
 *                     "code": "55",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "518",
 *                     "name": "沪教版",
 *                     "pid": "510",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "519",
 *                     "name": "教科版",
 *                     "pid": "510",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "520",
 *                     "name": "教科新版",
 *                     "pid": "510",
 *                     "code": "71",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "521",
 *                     "name": "鲁人版",
 *                     "pid": "510",
 *                     "code": "14",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "522",
 *                     "name": "鲁人新版",
 *                     "pid": "510",
 *                     "code": "75",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "523",
 *                     "name": "人民版",
 *                     "pid": "510",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "524",
 *                     "name": "人民新版",
 *                     "pid": "510",
 *                     "code": "76",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "525",
 *                     "name": "陕教版",
 *                     "pid": "510",
 *                     "code": "98",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "526",
 *                     "name": "陕教新版",
 *                     "pid": "510",
 *                     "code": "77",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "527",
 *                     "name": "苏人版",
 *                     "pid": "510",
 *                     "code": "99",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "528",
 *                     "name": "苏人新版",
 *                     "pid": "510",
 *                     "code": "78",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "529",
 *                     "name": "湘师大版",
 *                     "pid": "510",
 *                     "code": "100",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "530",
 *                     "name": "湘师大新版",
 *                     "pid": "510",
 *                     "code": "79",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "531",
 *                 "name": "数学",
 *                 "pid": "498",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "532",
 *                     "name": "人教新版",
 *                     "pid": "531",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "533",
 *                     "name": "北师大新版",
 *                     "pid": "531",
 *                     "code": "55",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "534",
 *                     "name": "华师大新版",
 *                     "pid": "531",
 *                     "code": "63",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "535",
 *                     "name": "苏科新版",
 *                     "pid": "531",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "536",
 *                     "name": "湘教新版",
 *                     "pid": "531",
 *                     "code": "68",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "537",
 *                     "name": "青岛新版",
 *                     "pid": "531",
 *                     "code": "65",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "538",
 *                     "name": "浙教新版",
 *                     "pid": "531",
 *                     "code": "69",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "539",
 *                     "name": "冀教新版",
 *                     "pid": "531",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "540",
 *                     "name": "沪科新版",
 *                     "pid": "531",
 *                     "code": "70",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "541",
 *                     "name": "鲁教五四新版",
 *                     "pid": "531",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "542",
 *                     "name": "北京课改新版",
 *                     "pid": "531",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "543",
 *                     "name": "沪教新版",
 *                     "pid": "531",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "544",
 *                     "name": "人教五四新版",
 *                     "pid": "531",
 *                     "code": "66",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "545",
 *                     "name": "沪科版",
 *                     "pid": "531",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "546",
 *                     "name": "沪教版",
 *                     "pid": "531",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "547",
 *                 "name": "地理",
 *                 "pid": "498",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "548",
 *                     "name": "人教新版",
 *                     "pid": "547",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "549",
 *                     "name": "鲁教五四新版",
 *                     "pid": "547",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "550",
 *                     "name": "中图版",
 *                     "pid": "547",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "551",
 *                     "name": "湘教版",
 *                     "pid": "547",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "552",
 *                     "name": "粤人版",
 *                     "pid": "547",
 *                     "code": "24",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "553",
 *                     "name": "北京课改版",
 *                     "pid": "547",
 *                     "code": "25",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "554",
 *                     "name": "仁爱版",
 *                     "pid": "547",
 *                     "code": "93",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "555",
 *                     "name": "粤教版",
 *                     "pid": "547",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "556",
 *                     "name": "晋教版",
 *                     "pid": "547",
 *                     "code": "96",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "557",
 *                     "name": "商务星球版",
 *                     "pid": "547",
 *                     "code": "97",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "558",
 *                     "name": "浙教版",
 *                     "pid": "547",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "559",
 *                     "name": "沪教版",
 *                     "pid": "547",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "560",
 *                 "name": "生物",
 *                 "pid": "498",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "561",
 *                     "name": "人教新版",
 *                     "pid": "560",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "562",
 *                     "name": "苏科新版",
 *                     "pid": "560",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "563",
 *                     "name": "冀少新版",
 *                     "pid": "560",
 *                     "code": "73",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "564",
 *                     "name": "鲁科五四新版",
 *                     "pid": "560",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "565",
 *                     "name": "苏教版",
 *                     "pid": "560",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "566",
 *                     "name": "北师大版",
 *                     "pid": "560",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "567",
 *                     "name": "北京课改版",
 *                     "pid": "560",
 *                     "code": "25",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "568",
 *                     "name": "济南版",
 *                     "pid": "560",
 *                     "code": "27",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "569",
 *                     "name": "浙教版",
 *                     "pid": "560",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "570",
 *                     "name": "鲁教五四版",
 *                     "pid": "560",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "571",
 *                     "name": "鲁教五四新版",
 *                     "pid": "560",
 *                     "code": "64",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "572",
 *                 "name": "语文",
 *                 "pid": "498",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "573",
 *                     "name": "部编版",
 *                     "pid": "572",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "574",
 *                     "name": "苏教版",
 *                     "pid": "572",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "575",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "572",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "576",
 *                     "name": "北师大版",
 *                     "pid": "572",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "577",
 *                     "name": "牛津版2012（深圳·广州）",
 *                     "pid": "572",
 *                     "code": "53",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "578",
 *                     "name": "部编版五四制",
 *                     "pid": "572",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "579",
 *                 "name": "科学",
 *                 "pid": "498",
 *                 "code": "10",
 *                 "child": [
 *                   {
 *                     "id": "580",
 *                     "name": "浙教版",
 *                     "pid": "579",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "581",
 *                     "name": "华师大版",
 *                     "pid": "579",
 *                     "code": "29",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "582",
 *                 "name": "英语",
 *                 "pid": "498",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "583",
 *                     "name": "牛津版2014（深圳·广州）",
 *                     "pid": "582",
 *                     "code": "51",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "584",
 *                     "name": "仁爱科普版",
 *                     "pid": "582",
 *                     "code": "47",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "585",
 *                     "name": "新目标(Go for it)版",
 *                     "pid": "582",
 *                     "code": "49",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "586",
 *                     "name": "外研（新标准）版",
 *                     "pid": "582",
 *                     "code": "48",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "587",
 *                     "name": "牛津译林版",
 *                     "pid": "582",
 *                     "code": "50",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "588",
 *                     "name": "鲁教五四新版",
 *                     "pid": "582",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "589",
 *                     "name": "北师大版",
 *                     "pid": "582",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "590",
 *                     "name": "冀教版",
 *                     "pid": "582",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "591",
 *                     "name": "牛津上海（本地版）五四制",
 *                     "pid": "582",
 *                     "code": "120",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "592",
 *                     "name": "北京课改新版",
 *                     "pid": "582",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "593",
 *                     "name": "沪教牛津版",
 *                     "pid": "582",
 *                     "code": "127",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "594",
 *                     "name": "人教五四版",
 *                     "pid": "582",
 *                     "code": "94",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "595",
 *                 "name": "物理",
 *                 "pid": "498",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "596",
 *                     "name": "浙教版",
 *                     "pid": "595",
 *                     "code": "22",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "597",
 *                 "name": "历史与社会",
 *                 "pid": "498",
 *                 "code": "12",
 *                 "child": [
 *                   {
 *                     "id": "598",
 *                     "name": "人教版",
 *                     "pid": "597",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "599",
 *             "name": "七年级下",
 *             "pid": "452",
 *             "code": "202",
 *             "child": [
 *               {
 *                 "id": "600",
 *                 "name": "历史",
 *                 "pid": "599",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "601",
 *                     "name": "部编版",
 *                     "pid": "600",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "602",
 *                     "name": "人教版",
 *                     "pid": "600",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "603",
 *                     "name": "北师大版",
 *                     "pid": "600",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "604",
 *                     "name": "部编版五四制",
 *                     "pid": "600",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "605",
 *                     "name": "川教版",
 *                     "pid": "600",
 *                     "code": "35",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "606",
 *                     "name": "华师大版",
 *                     "pid": "600",
 *                     "code": "29",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "607",
 *                     "name": "冀教版",
 *                     "pid": "600",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "608",
 *                     "name": "岳麓版",
 *                     "pid": "600",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "609",
 *                     "name": "中华书局版",
 *                     "pid": "600",
 *                     "code": "101",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "610",
 *                     "name": "中图版",
 *                     "pid": "600",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "611",
 *                 "name": "道德与法治",
 *                 "pid": "599",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "612",
 *                     "name": "部编版",
 *                     "pid": "611",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "613",
 *                     "name": "人教版",
 *                     "pid": "611",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "614",
 *                     "name": "部编版五四制",
 *                     "pid": "611",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "615",
 *                     "name": "粤教版",
 *                     "pid": "611",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "616",
 *                     "name": "粤教新版",
 *                     "pid": "611",
 *                     "code": "72",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "617",
 *                     "name": "北师大版",
 *                     "pid": "611",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "618",
 *                     "name": "北师大新版",
 *                     "pid": "611",
 *                     "code": "55",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "619",
 *                     "name": "沪教版",
 *                     "pid": "611",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "620",
 *                     "name": "教科版",
 *                     "pid": "611",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "621",
 *                     "name": "教科新版",
 *                     "pid": "611",
 *                     "code": "71",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "622",
 *                     "name": "鲁人版",
 *                     "pid": "611",
 *                     "code": "14",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "623",
 *                     "name": "鲁人新版",
 *                     "pid": "611",
 *                     "code": "75",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "624",
 *                     "name": "人民版",
 *                     "pid": "611",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "625",
 *                     "name": "人民新版",
 *                     "pid": "611",
 *                     "code": "76",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "626",
 *                     "name": "陕教版",
 *                     "pid": "611",
 *                     "code": "98",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "627",
 *                     "name": "陕教新版",
 *                     "pid": "611",
 *                     "code": "77",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "628",
 *                     "name": "苏人版",
 *                     "pid": "611",
 *                     "code": "99",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "629",
 *                     "name": "苏人新版",
 *                     "pid": "611",
 *                     "code": "78",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "630",
 *                     "name": "湘师大版",
 *                     "pid": "611",
 *                     "code": "100",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "631",
 *                     "name": "湘师大新版",
 *                     "pid": "611",
 *                     "code": "79",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "632",
 *                 "name": "数学",
 *                 "pid": "599",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "633",
 *                     "name": "人教新版",
 *                     "pid": "632",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "634",
 *                     "name": "北师大新版",
 *                     "pid": "632",
 *                     "code": "55",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "635",
 *                     "name": "华师大新版",
 *                     "pid": "632",
 *                     "code": "63",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "636",
 *                     "name": "苏科新版",
 *                     "pid": "632",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "637",
 *                     "name": "湘教新版",
 *                     "pid": "632",
 *                     "code": "68",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "638",
 *                     "name": "青岛新版",
 *                     "pid": "632",
 *                     "code": "65",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "639",
 *                     "name": "浙教新版",
 *                     "pid": "632",
 *                     "code": "69",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "640",
 *                     "name": "冀教新版",
 *                     "pid": "632",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "641",
 *                     "name": "沪科新版",
 *                     "pid": "632",
 *                     "code": "70",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "642",
 *                     "name": "鲁教五四新版",
 *                     "pid": "632",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "643",
 *                     "name": "北京课改新版",
 *                     "pid": "632",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "644",
 *                     "name": "沪教新版",
 *                     "pid": "632",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "645",
 *                     "name": "人教五四新版",
 *                     "pid": "632",
 *                     "code": "66",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "646",
 *                     "name": "沪科版",
 *                     "pid": "632",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "647",
 *                     "name": "沪教版",
 *                     "pid": "632",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "648",
 *                 "name": "地理",
 *                 "pid": "599",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "649",
 *                     "name": "人教新版",
 *                     "pid": "648",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "650",
 *                     "name": "鲁教五四新版",
 *                     "pid": "648",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "651",
 *                     "name": "湘教版",
 *                     "pid": "648",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "652",
 *                     "name": "粤人版",
 *                     "pid": "648",
 *                     "code": "24",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "653",
 *                     "name": "中图版",
 *                     "pid": "648",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "654",
 *                     "name": "北京课改版",
 *                     "pid": "648",
 *                     "code": "25",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "655",
 *                     "name": "仁爱版",
 *                     "pid": "648",
 *                     "code": "93",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "656",
 *                     "name": "粤教版",
 *                     "pid": "648",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "657",
 *                     "name": "晋教版",
 *                     "pid": "648",
 *                     "code": "96",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "658",
 *                     "name": "商务星球版",
 *                     "pid": "648",
 *                     "code": "97",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "659",
 *                     "name": "浙教版",
 *                     "pid": "648",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "660",
 *                     "name": "沪教版",
 *                     "pid": "648",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "661",
 *                 "name": "生物",
 *                 "pid": "599",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "662",
 *                     "name": "人教新版",
 *                     "pid": "661",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "663",
 *                     "name": "苏科新版",
 *                     "pid": "661",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "664",
 *                     "name": "冀少新版",
 *                     "pid": "661",
 *                     "code": "73",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "665",
 *                     "name": "鲁科五四新版",
 *                     "pid": "661",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "666",
 *                     "name": "苏教版",
 *                     "pid": "661",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "667",
 *                     "name": "北师大版",
 *                     "pid": "661",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "668",
 *                     "name": "北京课改版",
 *                     "pid": "661",
 *                     "code": "25",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "669",
 *                     "name": "济南版",
 *                     "pid": "661",
 *                     "code": "27",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "670",
 *                     "name": "浙教版",
 *                     "pid": "661",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "671",
 *                     "name": "鲁教五四版",
 *                     "pid": "661",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "672",
 *                     "name": "鲁教五四新版",
 *                     "pid": "661",
 *                     "code": "64",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "673",
 *                 "name": "语文",
 *                 "pid": "599",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "674",
 *                     "name": "部编版",
 *                     "pid": "673",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "675",
 *                     "name": "苏教版",
 *                     "pid": "673",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "676",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "673",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "677",
 *                     "name": "北师大版",
 *                     "pid": "673",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "678",
 *                     "name": "牛津版2012（深圳·广州）",
 *                     "pid": "673",
 *                     "code": "53",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "679",
 *                     "name": "语文版",
 *                     "pid": "673",
 *                     "code": "12",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "680",
 *                     "name": "部编版五四制",
 *                     "pid": "673",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "681",
 *                 "name": "科学",
 *                 "pid": "599",
 *                 "code": "10",
 *                 "child": [
 *                   {
 *                     "id": "682",
 *                     "name": "浙教版",
 *                     "pid": "681",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "683",
 *                     "name": "华师大版",
 *                     "pid": "681",
 *                     "code": "29",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "684",
 *                 "name": "英语",
 *                 "pid": "599",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "685",
 *                     "name": "仁爱科普版",
 *                     "pid": "684",
 *                     "code": "47",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "686",
 *                     "name": "牛津版2014（深圳·广州）",
 *                     "pid": "684",
 *                     "code": "51",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "687",
 *                     "name": "新目标(Go for it)版",
 *                     "pid": "684",
 *                     "code": "49",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "688",
 *                     "name": "外研（新标准）版",
 *                     "pid": "684",
 *                     "code": "48",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "689",
 *                     "name": "鲁教五四新版",
 *                     "pid": "684",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "690",
 *                     "name": "北师大版",
 *                     "pid": "684",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "691",
 *                     "name": "冀教版",
 *                     "pid": "684",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "692",
 *                     "name": "牛津上海（本地版）五四制",
 *                     "pid": "684",
 *                     "code": "120",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "693",
 *                     "name": "牛津译林版",
 *                     "pid": "684",
 *                     "code": "50",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "694",
 *                     "name": "北京课改新版",
 *                     "pid": "684",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "695",
 *                     "name": "沪教牛津版",
 *                     "pid": "684",
 *                     "code": "127",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "696",
 *                     "name": "人教五四版",
 *                     "pid": "684",
 *                     "code": "94",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "697",
 *                 "name": "物理",
 *                 "pid": "599",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "698",
 *                     "name": "浙教版",
 *                     "pid": "697",
 *                     "code": "22",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "699",
 *                 "name": "历史与社会",
 *                 "pid": "599",
 *                 "code": "12",
 *                 "child": [
 *                   {
 *                     "id": "700",
 *                     "name": "人教版",
 *                     "pid": "699",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "701",
 *             "name": "八年级",
 *             "pid": "452",
 *             "code": "300",
 *             "child": [
 *               {
 *                 "id": "702",
 *                 "name": "物理",
 *                 "pid": "701",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "703",
 *                     "name": "沪科新版",
 *                     "pid": "702",
 *                     "code": "70",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "704",
 *                 "name": "化学",
 *                 "pid": "701",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "705",
 *                     "name": "鲁教五四新版",
 *                     "pid": "704",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "706",
 *                     "name": "人教五四版",
 *                     "pid": "704",
 *                     "code": "94",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "707",
 *             "name": "八年级上",
 *             "pid": "452",
 *             "code": "301",
 *             "child": [
 *               {
 *                 "id": "708",
 *                 "name": "历史",
 *                 "pid": "707",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "709",
 *                     "name": "部编版",
 *                     "pid": "708",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "710",
 *                     "name": "人教版",
 *                     "pid": "708",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "711",
 *                     "name": "北师大版",
 *                     "pid": "708",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "712",
 *                     "name": "部编版五四制",
 *                     "pid": "708",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "713",
 *                     "name": "川教版",
 *                     "pid": "708",
 *                     "code": "35",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "714",
 *                     "name": "华师大版",
 *                     "pid": "708",
 *                     "code": "29",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "715",
 *                     "name": "冀教版",
 *                     "pid": "708",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "716",
 *                     "name": "岳麓版",
 *                     "pid": "708",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "717",
 *                     "name": "中华书局版",
 *                     "pid": "708",
 *                     "code": "101",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "718",
 *                     "name": "中图版",
 *                     "pid": "708",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "719",
 *                 "name": "道德与法治",
 *                 "pid": "707",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "720",
 *                     "name": "部编版",
 *                     "pid": "719",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "721",
 *                     "name": "人教版",
 *                     "pid": "719",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "722",
 *                     "name": "部编版五四制",
 *                     "pid": "719",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "723",
 *                     "name": "粤教版",
 *                     "pid": "719",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "724",
 *                     "name": "北师大版",
 *                     "pid": "719",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "725",
 *                     "name": "沪教版",
 *                     "pid": "719",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "726",
 *                     "name": "教科版",
 *                     "pid": "719",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "727",
 *                     "name": "鲁人版",
 *                     "pid": "719",
 *                     "code": "14",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "728",
 *                     "name": "人民版",
 *                     "pid": "719",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "729",
 *                     "name": "陕教版",
 *                     "pid": "719",
 *                     "code": "98",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "730",
 *                     "name": "苏人版",
 *                     "pid": "719",
 *                     "code": "99",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "731",
 *                     "name": "湘师大版",
 *                     "pid": "719",
 *                     "code": "100",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "732",
 *                 "name": "数学",
 *                 "pid": "707",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "733",
 *                     "name": "人教新版",
 *                     "pid": "732",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "734",
 *                     "name": "北师大新版",
 *                     "pid": "732",
 *                     "code": "55",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "735",
 *                     "name": "华师大新版",
 *                     "pid": "732",
 *                     "code": "63",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "736",
 *                     "name": "苏科新版",
 *                     "pid": "732",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "737",
 *                     "name": "湘教新版",
 *                     "pid": "732",
 *                     "code": "68",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "738",
 *                     "name": "青岛新版",
 *                     "pid": "732",
 *                     "code": "65",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "739",
 *                     "name": "浙教新版",
 *                     "pid": "732",
 *                     "code": "69",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "740",
 *                     "name": "冀教新版",
 *                     "pid": "732",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "741",
 *                     "name": "沪科新版",
 *                     "pid": "732",
 *                     "code": "70",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "742",
 *                     "name": "鲁教五四新版",
 *                     "pid": "732",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "743",
 *                     "name": "北京课改新版",
 *                     "pid": "732",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "744",
 *                     "name": "沪教新版",
 *                     "pid": "732",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "745",
 *                     "name": "人教五四新版",
 *                     "pid": "732",
 *                     "code": "66",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "746",
 *                     "name": "沪科版",
 *                     "pid": "732",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "747",
 *                     "name": "沪教版",
 *                     "pid": "732",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "748",
 *                 "name": "物理",
 *                 "pid": "707",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "749",
 *                     "name": "人教新版",
 *                     "pid": "748",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "750",
 *                     "name": "教科新版",
 *                     "pid": "748",
 *                     "code": "71",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "751",
 *                     "name": "北京课改新版",
 *                     "pid": "748",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "752",
 *                     "name": "鲁科五四新版",
 *                     "pid": "748",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "753",
 *                     "name": "北师大版",
 *                     "pid": "748",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "754",
 *                     "name": "苏科版",
 *                     "pid": "748",
 *                     "code": "5",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "755",
 *                     "name": "鲁教版",
 *                     "pid": "748",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "756",
 *                     "name": "粤教沪科版",
 *                     "pid": "748",
 *                     "code": "31",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "757",
 *                     "name": "沪教版",
 *                     "pid": "748",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "758",
 *                     "name": "沪粤版",
 *                     "pid": "748",
 *                     "code": "41",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "759",
 *                     "name": "鲁教五四版",
 *                     "pid": "748",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "760",
 *                     "name": "鲁教五四新版",
 *                     "pid": "748",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "761",
 *                     "name": "苏教版",
 *                     "pid": "748",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "762",
 *                     "name": "粤教版",
 *                     "pid": "748",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "763",
 *                     "name": "华师大版",
 *                     "pid": "748",
 *                     "code": "29",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "764",
 *                     "name": "浙教版",
 *                     "pid": "748",
 *                     "code": "22",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "765",
 *                 "name": "地理",
 *                 "pid": "707",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "766",
 *                     "name": "人教新版",
 *                     "pid": "765",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "767",
 *                     "name": "湘教版",
 *                     "pid": "765",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "768",
 *                     "name": "粤人版",
 *                     "pid": "765",
 *                     "code": "24",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "769",
 *                     "name": "北京课改版",
 *                     "pid": "765",
 *                     "code": "25",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "770",
 *                     "name": "仁爱版",
 *                     "pid": "765",
 *                     "code": "93",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "771",
 *                     "name": "粤教版",
 *                     "pid": "765",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "772",
 *                     "name": "晋教版",
 *                     "pid": "765",
 *                     "code": "96",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "773",
 *                     "name": "商务星球版",
 *                     "pid": "765",
 *                     "code": "97",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "774",
 *                     "name": "浙教版",
 *                     "pid": "765",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "775",
 *                     "name": "中图版",
 *                     "pid": "765",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "776",
 *                 "name": "生物",
 *                 "pid": "707",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "777",
 *                     "name": "人教新版",
 *                     "pid": "776",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "778",
 *                     "name": "苏科新版",
 *                     "pid": "776",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "779",
 *                     "name": "冀少新版",
 *                     "pid": "776",
 *                     "code": "73",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "780",
 *                     "name": "鲁科五四新版",
 *                     "pid": "776",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "781",
 *                     "name": "苏教版",
 *                     "pid": "776",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "782",
 *                     "name": "北师大版",
 *                     "pid": "776",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "783",
 *                     "name": "北京课改版",
 *                     "pid": "776",
 *                     "code": "25",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "784",
 *                     "name": "济南版",
 *                     "pid": "776",
 *                     "code": "27",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "785",
 *                     "name": "沪教版",
 *                     "pid": "776",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "786",
 *                     "name": "沪教版（上海版）",
 *                     "pid": "776",
 *                     "code": "103",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "787",
 *                     "name": "浙教版",
 *                     "pid": "776",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "788",
 *                     "name": "鲁教五四版",
 *                     "pid": "776",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "789",
 *                     "name": "鲁教五四新版",
 *                     "pid": "776",
 *                     "code": "64",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "790",
 *                 "name": "语文",
 *                 "pid": "707",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "791",
 *                     "name": "部编版",
 *                     "pid": "790",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "792",
 *                     "name": "苏教版",
 *                     "pid": "790",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "793",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "790",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "794",
 *                     "name": "北师大版",
 *                     "pid": "790",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "795",
 *                     "name": "牛津版2012（深圳·广州）",
 *                     "pid": "790",
 *                     "code": "53",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "796",
 *                     "name": "语文版",
 *                     "pid": "790",
 *                     "code": "12",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "797",
 *                     "name": "部编版五四制",
 *                     "pid": "790",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "798",
 *                 "name": "科学",
 *                 "pid": "707",
 *                 "code": "10",
 *                 "child": [
 *                   {
 *                     "id": "799",
 *                     "name": "浙教版",
 *                     "pid": "798",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "800",
 *                     "name": "华师大版",
 *                     "pid": "798",
 *                     "code": "29",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "801",
 *                 "name": "英语",
 *                 "pid": "707",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "802",
 *                     "name": "仁爱科普版",
 *                     "pid": "801",
 *                     "code": "47",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "803",
 *                     "name": "牛津版2014（深圳·广州）",
 *                     "pid": "801",
 *                     "code": "51",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "804",
 *                     "name": "新目标(Go for it)版",
 *                     "pid": "801",
 *                     "code": "49",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "805",
 *                     "name": "外研（新标准）版",
 *                     "pid": "801",
 *                     "code": "48",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "806",
 *                     "name": "鲁教五四新版",
 *                     "pid": "801",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "807",
 *                     "name": "北师大版",
 *                     "pid": "801",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "808",
 *                     "name": "冀教版",
 *                     "pid": "801",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "809",
 *                     "name": "牛津上海（本地版）五四制",
 *                     "pid": "801",
 *                     "code": "120",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "810",
 *                     "name": "牛津译林版",
 *                     "pid": "801",
 *                     "code": "50",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "811",
 *                     "name": "北京课改新版",
 *                     "pid": "801",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "812",
 *                     "name": "沪教牛津版",
 *                     "pid": "801",
 *                     "code": "127",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "813",
 *                     "name": "人教五四版",
 *                     "pid": "801",
 *                     "code": "94",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "814",
 *                 "name": "化学",
 *                 "pid": "707",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "815",
 *                     "name": "浙教版",
 *                     "pid": "814",
 *                     "code": "22",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "816",
 *                 "name": "历史与社会",
 *                 "pid": "707",
 *                 "code": "12",
 *                 "child": [
 *                   {
 *                     "id": "817",
 *                     "name": "人教版",
 *                     "pid": "816",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "818",
 *             "name": "八年级下",
 *             "pid": "452",
 *             "code": "302",
 *             "child": [
 *               {
 *                 "id": "819",
 *                 "name": "历史",
 *                 "pid": "818",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "820",
 *                     "name": "部编版",
 *                     "pid": "819",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "821",
 *                     "name": "人教版",
 *                     "pid": "819",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "822",
 *                     "name": "北师大版",
 *                     "pid": "819",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "823",
 *                     "name": "部编版五四制",
 *                     "pid": "819",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "824",
 *                     "name": "川教版",
 *                     "pid": "819",
 *                     "code": "35",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "825",
 *                     "name": "华师大版",
 *                     "pid": "819",
 *                     "code": "29",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "826",
 *                     "name": "冀教版",
 *                     "pid": "819",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "827",
 *                     "name": "岳麓版",
 *                     "pid": "819",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "828",
 *                     "name": "中华书局版",
 *                     "pid": "819",
 *                     "code": "101",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "829",
 *                     "name": "中图版",
 *                     "pid": "819",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "830",
 *                 "name": "道德与法治",
 *                 "pid": "818",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "831",
 *                     "name": "部编版",
 *                     "pid": "830",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "832",
 *                     "name": "人教版",
 *                     "pid": "830",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "833",
 *                     "name": "部编版五四制",
 *                     "pid": "830",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "834",
 *                     "name": "粤教版",
 *                     "pid": "830",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "835",
 *                     "name": "北师大版",
 *                     "pid": "830",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "836",
 *                     "name": "沪教版",
 *                     "pid": "830",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "837",
 *                     "name": "教科版",
 *                     "pid": "830",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "838",
 *                     "name": "鲁人版",
 *                     "pid": "830",
 *                     "code": "14",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "839",
 *                     "name": "人民版",
 *                     "pid": "830",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "840",
 *                     "name": "陕教版",
 *                     "pid": "830",
 *                     "code": "98",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "841",
 *                     "name": "苏人版",
 *                     "pid": "830",
 *                     "code": "99",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "842",
 *                     "name": "湘师大版",
 *                     "pid": "830",
 *                     "code": "100",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "843",
 *                 "name": "数学",
 *                 "pid": "818",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "844",
 *                     "name": "人教新版",
 *                     "pid": "843",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "845",
 *                     "name": "北师大新版",
 *                     "pid": "843",
 *                     "code": "55",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "846",
 *                     "name": "华师大新版",
 *                     "pid": "843",
 *                     "code": "63",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "847",
 *                     "name": "苏科新版",
 *                     "pid": "843",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "848",
 *                     "name": "湘教新版",
 *                     "pid": "843",
 *                     "code": "68",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "849",
 *                     "name": "青岛新版",
 *                     "pid": "843",
 *                     "code": "65",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "850",
 *                     "name": "浙教新版",
 *                     "pid": "843",
 *                     "code": "69",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "851",
 *                     "name": "冀教新版",
 *                     "pid": "843",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "852",
 *                     "name": "沪科新版",
 *                     "pid": "843",
 *                     "code": "70",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "853",
 *                     "name": "鲁教五四新版",
 *                     "pid": "843",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "854",
 *                     "name": "北京课改新版",
 *                     "pid": "843",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "855",
 *                     "name": "沪教新版",
 *                     "pid": "843",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "856",
 *                     "name": "人教五四新版",
 *                     "pid": "843",
 *                     "code": "66",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "857",
 *                     "name": "沪科版",
 *                     "pid": "843",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "858",
 *                     "name": "沪教版",
 *                     "pid": "843",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "859",
 *                 "name": "物理",
 *                 "pid": "818",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "860",
 *                     "name": "人教新版",
 *                     "pid": "859",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "861",
 *                     "name": "教科新版",
 *                     "pid": "859",
 *                     "code": "71",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "862",
 *                     "name": "北京课改新版",
 *                     "pid": "859",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "863",
 *                     "name": "鲁科五四新版",
 *                     "pid": "859",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "864",
 *                     "name": "北师大版",
 *                     "pid": "859",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "865",
 *                     "name": "苏科版",
 *                     "pid": "859",
 *                     "code": "5",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "866",
 *                     "name": "鲁教版",
 *                     "pid": "859",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "867",
 *                     "name": "粤教沪科版",
 *                     "pid": "859",
 *                     "code": "31",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "868",
 *                     "name": "沪教版",
 *                     "pid": "859",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "869",
 *                     "name": "沪粤版",
 *                     "pid": "859",
 *                     "code": "41",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "870",
 *                     "name": "鲁教五四版",
 *                     "pid": "859",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "871",
 *                     "name": "鲁教五四新版",
 *                     "pid": "859",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "872",
 *                     "name": "苏教版",
 *                     "pid": "859",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "873",
 *                     "name": "粤教版",
 *                     "pid": "859",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "874",
 *                     "name": "华师大版",
 *                     "pid": "859",
 *                     "code": "29",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "875",
 *                     "name": "浙教版",
 *                     "pid": "859",
 *                     "code": "22",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "876",
 *                 "name": "地理",
 *                 "pid": "818",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "877",
 *                     "name": "人教新版",
 *                     "pid": "876",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "878",
 *                     "name": "湘教版",
 *                     "pid": "876",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "879",
 *                     "name": "粤人版",
 *                     "pid": "876",
 *                     "code": "24",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "880",
 *                     "name": "北京课改版",
 *                     "pid": "876",
 *                     "code": "25",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "881",
 *                     "name": "仁爱版",
 *                     "pid": "876",
 *                     "code": "93",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "882",
 *                     "name": "粤教版",
 *                     "pid": "876",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "883",
 *                     "name": "晋教版",
 *                     "pid": "876",
 *                     "code": "96",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "884",
 *                     "name": "商务星球版",
 *                     "pid": "876",
 *                     "code": "97",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "885",
 *                     "name": "浙教版",
 *                     "pid": "876",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "886",
 *                     "name": "中图版",
 *                     "pid": "876",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "887",
 *                 "name": "生物",
 *                 "pid": "818",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "888",
 *                     "name": "人教新版",
 *                     "pid": "887",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "889",
 *                     "name": "苏科新版",
 *                     "pid": "887",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "890",
 *                     "name": "冀少新版",
 *                     "pid": "887",
 *                     "code": "73",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "891",
 *                     "name": "鲁科五四新版",
 *                     "pid": "887",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "892",
 *                     "name": "苏教版",
 *                     "pid": "887",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "893",
 *                     "name": "北师大版",
 *                     "pid": "887",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "894",
 *                     "name": "北京课改版",
 *                     "pid": "887",
 *                     "code": "25",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "895",
 *                     "name": "济南版",
 *                     "pid": "887",
 *                     "code": "27",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "896",
 *                     "name": "沪教版",
 *                     "pid": "887",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "897",
 *                     "name": "沪教版（上海版）",
 *                     "pid": "887",
 *                     "code": "103",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "898",
 *                     "name": "浙教版",
 *                     "pid": "887",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "899",
 *                     "name": "鲁教五四版",
 *                     "pid": "887",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "900",
 *                     "name": "鲁教五四新版",
 *                     "pid": "887",
 *                     "code": "64",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "901",
 *                 "name": "语文",
 *                 "pid": "818",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "902",
 *                     "name": "部编版",
 *                     "pid": "901",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "903",
 *                     "name": "苏教版",
 *                     "pid": "901",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "904",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "901",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "905",
 *                     "name": "北师大版",
 *                     "pid": "901",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "906",
 *                     "name": "语文版",
 *                     "pid": "901",
 *                     "code": "12",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "907",
 *                     "name": "部编版五四制",
 *                     "pid": "901",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "908",
 *                 "name": "科学",
 *                 "pid": "818",
 *                 "code": "10",
 *                 "child": [
 *                   {
 *                     "id": "909",
 *                     "name": "浙教版",
 *                     "pid": "908",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "910",
 *                     "name": "华师大版",
 *                     "pid": "908",
 *                     "code": "29",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "911",
 *                 "name": "英语",
 *                 "pid": "818",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "912",
 *                     "name": "牛津版2014（深圳·广州）",
 *                     "pid": "911",
 *                     "code": "51",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "913",
 *                     "name": "仁爱科普版",
 *                     "pid": "911",
 *                     "code": "47",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "914",
 *                     "name": "外研（新标准）版",
 *                     "pid": "911",
 *                     "code": "48",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "915",
 *                     "name": "新目标(Go for it)版",
 *                     "pid": "911",
 *                     "code": "49",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "916",
 *                     "name": "鲁教五四新版",
 *                     "pid": "911",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "917",
 *                     "name": "北师大版",
 *                     "pid": "911",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "918",
 *                     "name": "冀教版",
 *                     "pid": "911",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "919",
 *                     "name": "牛津上海（本地版）五四制",
 *                     "pid": "911",
 *                     "code": "120",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "920",
 *                     "name": "牛津译林版",
 *                     "pid": "911",
 *                     "code": "50",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "921",
 *                     "name": "北京课改新版",
 *                     "pid": "911",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "922",
 *                     "name": "沪教牛津版",
 *                     "pid": "911",
 *                     "code": "127",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "923",
 *                     "name": "人教五四版",
 *                     "pid": "911",
 *                     "code": "94",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "924",
 *                 "name": "化学",
 *                 "pid": "818",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "925",
 *                     "name": "浙教版",
 *                     "pid": "924",
 *                     "code": "22",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "926",
 *                 "name": "历史与社会",
 *                 "pid": "818",
 *                 "code": "12",
 *                 "child": [
 *                   {
 *                     "id": "927",
 *                     "name": "人教版",
 *                     "pid": "926",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "928",
 *             "name": "九年级",
 *             "pid": "452",
 *             "code": "400",
 *             "child": [
 *               {
 *                 "id": "929",
 *                 "name": "物理",
 *                 "pid": "928",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "930",
 *                     "name": "沪科新版",
 *                     "pid": "929",
 *                     "code": "70",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "931",
 *                 "name": "化学",
 *                 "pid": "928",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "932",
 *                     "name": "鲁教五四新版",
 *                     "pid": "931",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "933",
 *                     "name": "人教五四版",
 *                     "pid": "931",
 *                     "code": "94",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "934",
 *                     "name": "北师大版",
 *                     "pid": "931",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "935",
 *                     "name": "苏教版",
 *                     "pid": "931",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "936",
 *                 "name": "英语",
 *                 "pid": "928",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "937",
 *                     "name": "新目标(Go for it)版",
 *                     "pid": "936",
 *                     "code": "49",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "938",
 *                     "name": "鲁教五四新版",
 *                     "pid": "936",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "939",
 *                     "name": "北师大版",
 *                     "pid": "936",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "940",
 *                     "name": "北京课改新版",
 *                     "pid": "936",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "941",
 *                     "name": "人教五四版",
 *                     "pid": "936",
 *                     "code": "94",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "942",
 *                 "name": "道德与法治",
 *                 "pid": "928",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "943",
 *                     "name": "粤教版",
 *                     "pid": "942",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "944",
 *                     "name": "北师大版",
 *                     "pid": "942",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "945",
 *                     "name": "教科版",
 *                     "pid": "942",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "946",
 *                     "name": "鲁人版",
 *                     "pid": "942",
 *                     "code": "14",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "947",
 *                     "name": "人民版",
 *                     "pid": "942",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "948",
 *                     "name": "陕教版",
 *                     "pid": "942",
 *                     "code": "98",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "949",
 *                     "name": "苏人版",
 *                     "pid": "942",
 *                     "code": "99",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "950",
 *                     "name": "湘师大版",
 *                     "pid": "942",
 *                     "code": "100",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "951",
 *             "name": "九年级上",
 *             "pid": "452",
 *             "code": "401",
 *             "child": [
 *               {
 *                 "id": "952",
 *                 "name": "历史",
 *                 "pid": "951",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "953",
 *                     "name": "部编版",
 *                     "pid": "952",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "954",
 *                     "name": "人教版",
 *                     "pid": "952",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "955",
 *                     "name": "北师大版",
 *                     "pid": "952",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "956",
 *                     "name": "川教版",
 *                     "pid": "952",
 *                     "code": "35",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "957",
 *                     "name": "华师大版",
 *                     "pid": "952",
 *                     "code": "29",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "958",
 *                     "name": "冀教版",
 *                     "pid": "952",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "959",
 *                     "name": "岳麓版",
 *                     "pid": "952",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "960",
 *                     "name": "中华书局版",
 *                     "pid": "952",
 *                     "code": "101",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "961",
 *                     "name": "中图版",
 *                     "pid": "952",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "962",
 *                 "name": "道德与法治",
 *                 "pid": "951",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "963",
 *                     "name": "部编版",
 *                     "pid": "962",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "964",
 *                     "name": "人教版",
 *                     "pid": "962",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "965",
 *                     "name": "部编版五四制",
 *                     "pid": "962",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "966",
 *                     "name": "沪教版",
 *                     "pid": "962",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "967",
 *                 "name": "数学",
 *                 "pid": "951",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "968",
 *                     "name": "人教新版",
 *                     "pid": "967",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "969",
 *                     "name": "北师大新版",
 *                     "pid": "967",
 *                     "code": "55",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "970",
 *                     "name": "华师大新版",
 *                     "pid": "967",
 *                     "code": "63",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "971",
 *                     "name": "苏科新版",
 *                     "pid": "967",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "972",
 *                     "name": "湘教新版",
 *                     "pid": "967",
 *                     "code": "68",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "973",
 *                     "name": "青岛新版",
 *                     "pid": "967",
 *                     "code": "65",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "974",
 *                     "name": "浙教新版",
 *                     "pid": "967",
 *                     "code": "69",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "975",
 *                     "name": "冀教新版",
 *                     "pid": "967",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "976",
 *                     "name": "沪科新版",
 *                     "pid": "967",
 *                     "code": "70",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "977",
 *                     "name": "鲁教五四新版",
 *                     "pid": "967",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "978",
 *                     "name": "北京课改新版",
 *                     "pid": "967",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "979",
 *                     "name": "沪教新版",
 *                     "pid": "967",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "980",
 *                     "name": "人教五四新版",
 *                     "pid": "967",
 *                     "code": "66",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "981",
 *                     "name": "沪科版",
 *                     "pid": "967",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "982",
 *                     "name": "沪教版",
 *                     "pid": "967",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "983",
 *                 "name": "物理",
 *                 "pid": "951",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "984",
 *                     "name": "人教新版",
 *                     "pid": "983",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "985",
 *                     "name": "教科新版",
 *                     "pid": "983",
 *                     "code": "71",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "986",
 *                     "name": "北京课改新版",
 *                     "pid": "983",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "987",
 *                     "name": "鲁科五四新版",
 *                     "pid": "983",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "988",
 *                     "name": "北师大版",
 *                     "pid": "983",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "989",
 *                     "name": "苏科版",
 *                     "pid": "983",
 *                     "code": "5",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "990",
 *                     "name": "鲁教版",
 *                     "pid": "983",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "991",
 *                     "name": "粤教沪科版",
 *                     "pid": "983",
 *                     "code": "31",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "992",
 *                     "name": "沪教版",
 *                     "pid": "983",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "993",
 *                     "name": "沪粤版",
 *                     "pid": "983",
 *                     "code": "41",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "994",
 *                     "name": "鲁教五四版",
 *                     "pid": "983",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "995",
 *                     "name": "鲁教五四新版",
 *                     "pid": "983",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "996",
 *                     "name": "苏教版",
 *                     "pid": "983",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "997",
 *                     "name": "粤教版",
 *                     "pid": "983",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "998",
 *                     "name": "浙教版",
 *                     "pid": "983",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "999",
 *                     "name": "华师大版",
 *                     "pid": "983",
 *                     "code": "29",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1000",
 *                 "name": "化学",
 *                 "pid": "951",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1001",
 *                     "name": "人教新版",
 *                     "pid": "1000",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1002",
 *                     "name": "鲁教新版",
 *                     "pid": "1000",
 *                     "code": "80",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1003",
 *                     "name": "北京课改新版",
 *                     "pid": "1000",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1004",
 *                     "name": "上海新版",
 *                     "pid": "1000",
 *                     "code": "83",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1005",
 *                     "name": "粤教版",
 *                     "pid": "1000",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1006",
 *                     "name": "沪教版",
 *                     "pid": "1000",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1007",
 *                     "name": "浙教版",
 *                     "pid": "1000",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1008",
 *                     "name": "仁爱版",
 *                     "pid": "1000",
 *                     "code": "93",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1009",
 *                     "name": "湘教版",
 *                     "pid": "1000",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1010",
 *                     "name": "沪教新版",
 *                     "pid": "1000",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1011",
 *                     "name": "科粤版",
 *                     "pid": "1000",
 *                     "code": "95",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1012",
 *                 "name": "语文",
 *                 "pid": "951",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1013",
 *                     "name": "部编版",
 *                     "pid": "1012",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1014",
 *                     "name": "苏教版",
 *                     "pid": "1012",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1015",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1012",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1016",
 *                     "name": "北师大版",
 *                     "pid": "1012",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1017",
 *                     "name": "语文版",
 *                     "pid": "1012",
 *                     "code": "12",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1018",
 *                     "name": "部编版五四制",
 *                     "pid": "1012",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1019",
 *                 "name": "科学",
 *                 "pid": "951",
 *                 "code": "10",
 *                 "child": [
 *                   {
 *                     "id": "1020",
 *                     "name": "浙教版",
 *                     "pid": "1019",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1021",
 *                     "name": "华师大版",
 *                     "pid": "1019",
 *                     "code": "29",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1022",
 *                 "name": "英语",
 *                 "pid": "951",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1023",
 *                     "name": "牛津版2014（深圳·广州）",
 *                     "pid": "1022",
 *                     "code": "51",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1024",
 *                     "name": "外研（新标准）版",
 *                     "pid": "1022",
 *                     "code": "48",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1025",
 *                     "name": "仁爱科普版",
 *                     "pid": "1022",
 *                     "code": "47",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1026",
 *                     "name": "冀教版",
 *                     "pid": "1022",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1027",
 *                     "name": "牛津上海（本地版）五四制",
 *                     "pid": "1022",
 *                     "code": "120",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1028",
 *                     "name": "牛津译林版",
 *                     "pid": "1022",
 *                     "code": "50",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1029",
 *                     "name": "沪教牛津版",
 *                     "pid": "1022",
 *                     "code": "127",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1030",
 *                 "name": "生物",
 *                 "pid": "951",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1031",
 *                     "name": "浙教版",
 *                     "pid": "1030",
 *                     "code": "22",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1032",
 *                 "name": "历史与社会",
 *                 "pid": "951",
 *                 "code": "12",
 *                 "child": [
 *                   {
 *                     "id": "1033",
 *                     "name": "人教版",
 *                     "pid": "1032",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1034",
 *             "name": "九年级下",
 *             "pid": "452",
 *             "code": "402",
 *             "child": [
 *               {
 *                 "id": "1035",
 *                 "name": "历史",
 *                 "pid": "1034",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1036",
 *                     "name": "部编版",
 *                     "pid": "1035",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1037",
 *                     "name": "人教版",
 *                     "pid": "1035",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1038",
 *                     "name": "北师大版",
 *                     "pid": "1035",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1039",
 *                     "name": "川教版",
 *                     "pid": "1035",
 *                     "code": "35",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1040",
 *                     "name": "华师大版",
 *                     "pid": "1035",
 *                     "code": "29",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1041",
 *                     "name": "冀教版",
 *                     "pid": "1035",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1042",
 *                     "name": "岳麓版",
 *                     "pid": "1035",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1043",
 *                     "name": "中华书局版",
 *                     "pid": "1035",
 *                     "code": "101",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1044",
 *                     "name": "中图版",
 *                     "pid": "1035",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1045",
 *                 "name": "道德与法治",
 *                 "pid": "1034",
 *                 "code": "11",
 *                 "child": [
 *                   {
 *                     "id": "1046",
 *                     "name": "部编版",
 *                     "pid": "1045",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1047",
 *                     "name": "人教版",
 *                     "pid": "1045",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1048",
 *                     "name": "部编版五四制",
 *                     "pid": "1045",
 *                     "code": "88",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1049",
 *                     "name": "沪教版",
 *                     "pid": "1045",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1050",
 *                 "name": "数学",
 *                 "pid": "1034",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1051",
 *                     "name": "人教新版",
 *                     "pid": "1050",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1052",
 *                     "name": "北师大新版",
 *                     "pid": "1050",
 *                     "code": "55",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1053",
 *                     "name": "华师大新版",
 *                     "pid": "1050",
 *                     "code": "63",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1054",
 *                     "name": "苏科新版",
 *                     "pid": "1050",
 *                     "code": "67",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1055",
 *                     "name": "湘教新版",
 *                     "pid": "1050",
 *                     "code": "68",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1056",
 *                     "name": "青岛新版",
 *                     "pid": "1050",
 *                     "code": "65",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1057",
 *                     "name": "浙教新版",
 *                     "pid": "1050",
 *                     "code": "69",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1058",
 *                     "name": "冀教新版",
 *                     "pid": "1050",
 *                     "code": "56",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1059",
 *                     "name": "沪科新版",
 *                     "pid": "1050",
 *                     "code": "70",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1060",
 *                     "name": "鲁教五四新版",
 *                     "pid": "1050",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1061",
 *                     "name": "北京课改新版",
 *                     "pid": "1050",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1062",
 *                     "name": "沪教新版",
 *                     "pid": "1050",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1063",
 *                     "name": "人教五四新版",
 *                     "pid": "1050",
 *                     "code": "66",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1064",
 *                     "name": "沪科版",
 *                     "pid": "1050",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1065",
 *                     "name": "沪教版",
 *                     "pid": "1050",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1066",
 *                 "name": "物理",
 *                 "pid": "1034",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1067",
 *                     "name": "教科新版",
 *                     "pid": "1066",
 *                     "code": "71",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1068",
 *                     "name": "鲁科五四新版",
 *                     "pid": "1066",
 *                     "code": "82",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1069",
 *                     "name": "苏科版",
 *                     "pid": "1066",
 *                     "code": "5",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1070",
 *                     "name": "鲁教版",
 *                     "pid": "1066",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1071",
 *                     "name": "粤教沪科版",
 *                     "pid": "1066",
 *                     "code": "31",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1072",
 *                     "name": "沪教版",
 *                     "pid": "1066",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1073",
 *                     "name": "沪粤版",
 *                     "pid": "1066",
 *                     "code": "41",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1074",
 *                     "name": "鲁教五四版",
 *                     "pid": "1066",
 *                     "code": "42",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1075",
 *                     "name": "鲁教五四新版",
 *                     "pid": "1066",
 *                     "code": "64",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1076",
 *                     "name": "苏教版",
 *                     "pid": "1066",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1077",
 *                     "name": "粤教版",
 *                     "pid": "1066",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1078",
 *                     "name": "华师大版",
 *                     "pid": "1066",
 *                     "code": "29",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1079",
 *                 "name": "化学",
 *                 "pid": "1034",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1080",
 *                     "name": "人教新版",
 *                     "pid": "1079",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1081",
 *                     "name": "鲁教新版",
 *                     "pid": "1079",
 *                     "code": "80",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1082",
 *                     "name": "北京课改新版",
 *                     "pid": "1079",
 *                     "code": "62",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1083",
 *                     "name": "上海新版",
 *                     "pid": "1079",
 *                     "code": "83",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1084",
 *                     "name": "粤教版",
 *                     "pid": "1079",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1085",
 *                     "name": "沪教版",
 *                     "pid": "1079",
 *                     "code": "21",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1086",
 *                     "name": "浙教版",
 *                     "pid": "1079",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1087",
 *                     "name": "仁爱版",
 *                     "pid": "1079",
 *                     "code": "93",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1088",
 *                     "name": "湘教版",
 *                     "pid": "1079",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1089",
 *                     "name": "沪教新版",
 *                     "pid": "1079",
 *                     "code": "74",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1090",
 *                     "name": "科粤版",
 *                     "pid": "1079",
 *                     "code": "95",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1091",
 *                 "name": "语文",
 *                 "pid": "1034",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1092",
 *                     "name": "部编版",
 *                     "pid": "1091",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1093",
 *                     "name": "苏教版",
 *                     "pid": "1091",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1094",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1091",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1095",
 *                     "name": "北师大版",
 *                     "pid": "1091",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1096",
 *                     "name": "语文版",
 *                     "pid": "1091",
 *                     "code": "12",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1097",
 *                     "name": "部编版五四制",
 *                     "pid": "1091",
 *                     "code": "88",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1098",
 *                 "name": "科学",
 *                 "pid": "1034",
 *                 "code": "10",
 *                 "child": [
 *                   {
 *                     "id": "1099",
 *                     "name": "浙教版",
 *                     "pid": "1098",
 *                     "code": "22",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1100",
 *                     "name": "华师大版",
 *                     "pid": "1098",
 *                     "code": "29",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1101",
 *                 "name": "英语",
 *                 "pid": "1034",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1102",
 *                     "name": "牛津版2014（深圳·广州）",
 *                     "pid": "1101",
 *                     "code": "51",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1103",
 *                     "name": "仁爱科普版",
 *                     "pid": "1101",
 *                     "code": "47",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1104",
 *                     "name": "外研（新标准）版",
 *                     "pid": "1101",
 *                     "code": "48",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1105",
 *                     "name": "冀教版",
 *                     "pid": "1101",
 *                     "code": "17",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1106",
 *                     "name": "牛津上海（本地版）五四制",
 *                     "pid": "1101",
 *                     "code": "120",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1107",
 *                     "name": "牛津译林版",
 *                     "pid": "1101",
 *                     "code": "50",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1108",
 *                     "name": "沪教牛津版",
 *                     "pid": "1101",
 *                     "code": "127",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1109",
 *                 "name": "生物",
 *                 "pid": "1034",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1110",
 *                     "name": "浙教版",
 *                     "pid": "1109",
 *                     "code": "22",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1111",
 *                 "name": "历史与社会",
 *                 "pid": "1034",
 *                 "code": "12",
 *                 "child": [
 *                   {
 *                     "id": "1112",
 *                     "name": "人教版",
 *                     "pid": "1111",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           }
 *         ]
 *       },
 *       {
 *         "id": "1113",
 *         "name": "高中",
 *         "pid": "0",
 *         "code": "3",
 *         "child": [
 *           {
 *             "id": "1114",
 *             "name": "高一",
 *             "pid": "1113",
 *             "code": "500",
 *             "child": [
 *               {
 *                 "id": "1115",
 *                 "name": "数学",
 *                 "pid": "1114",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1116",
 *                     "name": "沪教版",
 *                     "pid": "1115",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1117",
 *                 "name": "化学",
 *                 "pid": "1114",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1118",
 *                     "name": "沪科版",
 *                     "pid": "1117",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1119",
 *                     "name": "沪教版",
 *                     "pid": "1117",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1120",
 *                 "name": "生物",
 *                 "pid": "1114",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1121",
 *                     "name": "沪科版",
 *                     "pid": "1120",
 *                     "code": "9",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1122",
 *             "name": "高一上",
 *             "pid": "1113",
 *             "code": "501",
 *             "child": [
 *               {
 *                 "id": "1123",
 *                 "name": "生物",
 *                 "pid": "1122",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1124",
 *                     "name": "沪教新版",
 *                     "pid": "1123",
 *                     "code": "74",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1125",
 *                 "name": "数学",
 *                 "pid": "1122",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1126",
 *                     "name": "大纲版",
 *                     "pid": "1125",
 *                     "code": "39",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1127",
 *                 "name": "物理",
 *                 "pid": "1122",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1128",
 *                     "name": "上海版",
 *                     "pid": "1127",
 *                     "code": "92",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1129",
 *                 "name": "政治",
 *                 "pid": "1122",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1130",
 *                     "name": "沪教版",
 *                     "pid": "1129",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1131",
 *                 "name": "历史",
 *                 "pid": "1122",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1132",
 *                     "name": "华师版",
 *                     "pid": "1131",
 *                     "code": "102",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1133",
 *                 "name": "英语",
 *                 "pid": "1122",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1134",
 *                     "name": "牛津译林版",
 *                     "pid": "1133",
 *                     "code": "50",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1135",
 *             "name": "高一下",
 *             "pid": "1113",
 *             "code": "502",
 *             "child": [
 *               {
 *                 "id": "1136",
 *                 "name": "生物",
 *                 "pid": "1135",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1137",
 *                     "name": "沪教新版",
 *                     "pid": "1136",
 *                     "code": "74",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1138",
 *                 "name": "数学",
 *                 "pid": "1135",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1139",
 *                     "name": "大纲版",
 *                     "pid": "1138",
 *                     "code": "39",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1140",
 *                 "name": "物理",
 *                 "pid": "1135",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1141",
 *                     "name": "上海版",
 *                     "pid": "1140",
 *                     "code": "92",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1142",
 *                 "name": "政治",
 *                 "pid": "1135",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1143",
 *                     "name": "沪教版",
 *                     "pid": "1142",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1144",
 *                 "name": "历史",
 *                 "pid": "1135",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1145",
 *                     "name": "华师版",
 *                     "pid": "1144",
 *                     "code": "102",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1146",
 *                 "name": "英语",
 *                 "pid": "1135",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1147",
 *                     "name": "牛津译林版",
 *                     "pid": "1146",
 *                     "code": "50",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1148",
 *             "name": "高二",
 *             "pid": "1113",
 *             "code": "600",
 *             "child": [
 *               {
 *                 "id": "1149",
 *                 "name": "数学",
 *                 "pid": "1148",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1150",
 *                     "name": "沪教版",
 *                     "pid": "1149",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1151",
 *                 "name": "化学",
 *                 "pid": "1148",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1152",
 *                     "name": "沪科版",
 *                     "pid": "1151",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1153",
 *                     "name": "沪教版",
 *                     "pid": "1151",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1154",
 *                 "name": "生物",
 *                 "pid": "1148",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1155",
 *                     "name": "沪科版",
 *                     "pid": "1154",
 *                     "code": "9",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1156",
 *             "name": "高二上",
 *             "pid": "1113",
 *             "code": "601",
 *             "child": [
 *               {
 *                 "id": "1157",
 *                 "name": "生物",
 *                 "pid": "1156",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1158",
 *                     "name": "沪教新版",
 *                     "pid": "1157",
 *                     "code": "74",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1159",
 *                 "name": "数学",
 *                 "pid": "1156",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1160",
 *                     "name": "大纲版",
 *                     "pid": "1159",
 *                     "code": "39",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1161",
 *                 "name": "物理",
 *                 "pid": "1156",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1162",
 *                     "name": "上海版",
 *                     "pid": "1161",
 *                     "code": "92",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1163",
 *                 "name": "政治",
 *                 "pid": "1156",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1164",
 *                     "name": "沪教版",
 *                     "pid": "1163",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1165",
 *                 "name": "历史",
 *                 "pid": "1156",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1166",
 *                     "name": "华师版",
 *                     "pid": "1165",
 *                     "code": "102",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1167",
 *                 "name": "英语",
 *                 "pid": "1156",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1168",
 *                     "name": "牛津译林版",
 *                     "pid": "1167",
 *                     "code": "50",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1169",
 *             "name": "高二下",
 *             "pid": "1113",
 *             "code": "602",
 *             "child": [
 *               {
 *                 "id": "1170",
 *                 "name": "生物",
 *                 "pid": "1169",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1171",
 *                     "name": "沪教新版",
 *                     "pid": "1170",
 *                     "code": "74",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1172",
 *                 "name": "数学",
 *                 "pid": "1169",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1173",
 *                     "name": "大纲版",
 *                     "pid": "1172",
 *                     "code": "39",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1174",
 *                 "name": "物理",
 *                 "pid": "1169",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1175",
 *                     "name": "上海版",
 *                     "pid": "1174",
 *                     "code": "92",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1176",
 *                 "name": "政治",
 *                 "pid": "1169",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1177",
 *                     "name": "沪教版",
 *                     "pid": "1176",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1178",
 *                 "name": "历史",
 *                 "pid": "1169",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1179",
 *                     "name": "华师版",
 *                     "pid": "1178",
 *                     "code": "102",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1180",
 *                 "name": "英语",
 *                 "pid": "1169",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1181",
 *                     "name": "牛津译林版",
 *                     "pid": "1180",
 *                     "code": "50",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1182",
 *             "name": "高三",
 *             "pid": "1113",
 *             "code": "700",
 *             "child": [
 *               {
 *                 "id": "1183",
 *                 "name": "数学",
 *                 "pid": "1182",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1184",
 *                     "name": "沪教版",
 *                     "pid": "1183",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1185",
 *                 "name": "物理",
 *                 "pid": "1182",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1186",
 *                     "name": "上海版",
 *                     "pid": "1185",
 *                     "code": "92",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1187",
 *                 "name": "化学",
 *                 "pid": "1182",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1188",
 *                     "name": "沪教版",
 *                     "pid": "1187",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1189",
 *                 "name": "生物",
 *                 "pid": "1182",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1190",
 *                     "name": "沪科版",
 *                     "pid": "1189",
 *                     "code": "9",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1191",
 *             "name": "高三上",
 *             "pid": "1113",
 *             "code": "701",
 *             "child": [
 *               {
 *                 "id": "1192",
 *                 "name": "数学",
 *                 "pid": "1191",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1193",
 *                     "name": "大纲版",
 *                     "pid": "1192",
 *                     "code": "39",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1194",
 *                 "name": "物理",
 *                 "pid": "1191",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1195",
 *                     "name": "上海版",
 *                     "pid": "1194",
 *                     "code": "92",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1196",
 *                 "name": "政治",
 *                 "pid": "1191",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1197",
 *                     "name": "沪教版",
 *                     "pid": "1196",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1198",
 *                 "name": "历史",
 *                 "pid": "1191",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1199",
 *                     "name": "华师版",
 *                     "pid": "1198",
 *                     "code": "102",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1200",
 *                 "name": "英语",
 *                 "pid": "1191",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1201",
 *                     "name": "牛津译林版",
 *                     "pid": "1200",
 *                     "code": "50",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1202",
 *             "name": "高三下",
 *             "pid": "1113",
 *             "code": "702",
 *             "child": [
 *               {
 *                 "id": "1203",
 *                 "name": "数学",
 *                 "pid": "1202",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1204",
 *                     "name": "大纲版",
 *                     "pid": "1203",
 *                     "code": "39",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1205",
 *                 "name": "物理",
 *                 "pid": "1202",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1206",
 *                     "name": "上海版",
 *                     "pid": "1205",
 *                     "code": "92",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1207",
 *                 "name": "政治",
 *                 "pid": "1202",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1208",
 *                     "name": "沪教版",
 *                     "pid": "1207",
 *                     "code": "21",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1209",
 *                 "name": "历史",
 *                 "pid": "1202",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1210",
 *                     "name": "华师版",
 *                     "pid": "1209",
 *                     "code": "102",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1211",
 *             "name": "必修1",
 *             "pid": "1113",
 *             "code": "10100",
 *             "child": [
 *               {
 *                 "id": "1212",
 *                 "name": "地理",
 *                 "pid": "1211",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1213",
 *                     "name": "人教新版",
 *                     "pid": "1212",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1214",
 *                     "name": "人教版（2019）",
 *                     "pid": "1212",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1215",
 *                     "name": "湘教版",
 *                     "pid": "1212",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1216",
 *                     "name": "中图版",
 *                     "pid": "1212",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1217",
 *                     "name": "鲁教版",
 *                     "pid": "1212",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1218",
 *                     "name": "中图版2019",
 *                     "pid": "1212",
 *                     "code": "132",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1219",
 *                     "name": "鲁教版2019",
 *                     "pid": "1212",
 *                     "code": "133",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1220",
 *                     "name": "湘教版2019",
 *                     "pid": "1212",
 *                     "code": "135",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1221",
 *                 "name": "数学",
 *                 "pid": "1211",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1222",
 *                     "name": "人教A新版",
 *                     "pid": "1221",
 *                     "code": "84",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1223",
 *                     "name": "人教B新版",
 *                     "pid": "1221",
 *                     "code": "87",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1224",
 *                     "name": "北师大版",
 *                     "pid": "1221",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1225",
 *                     "name": "苏教版",
 *                     "pid": "1221",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1226",
 *                     "name": "湘教版",
 *                     "pid": "1221",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1227",
 *                     "name": "新课标人教A版",
 *                     "pid": "1221",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1228",
 *                     "name": "新课标人教B版",
 *                     "pid": "1221",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1229",
 *                     "name": "苏教版2019",
 *                     "pid": "1221",
 *                     "code": "105",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1230",
 *                     "name": "北师大版2019",
 *                     "pid": "1221",
 *                     "code": "106",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1231",
 *                     "name": "沪教版2020",
 *                     "pid": "1221",
 *                     "code": "107",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1232",
 *                 "name": "物理",
 *                 "pid": "1211",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1233",
 *                     "name": "人教版（2019）",
 *                     "pid": "1232",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1234",
 *                     "name": "粤教版",
 *                     "pid": "1232",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1235",
 *                     "name": "沪科版",
 *                     "pid": "1232",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1236",
 *                     "name": "鲁科版",
 *                     "pid": "1232",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1237",
 *                     "name": "教科版",
 *                     "pid": "1232",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1238",
 *                     "name": "教科版（2019）",
 *                     "pid": "1232",
 *                     "code": "89",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1239",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1232",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1240",
 *                     "name": "京教版",
 *                     "pid": "1232",
 *                     "code": "91",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1241",
 *                     "name": "人教版",
 *                     "pid": "1232",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1242",
 *                     "name": "粤教版2019",
 *                     "pid": "1232",
 *                     "code": "130",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1243",
 *                     "name": "沪科版2019",
 *                     "pid": "1232",
 *                     "code": "131",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1244",
 *                 "name": "生物",
 *                 "pid": "1211",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1245",
 *                     "name": "人教版（2019）",
 *                     "pid": "1244",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1246",
 *                     "name": "苏教版",
 *                     "pid": "1244",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1247",
 *                     "name": "浙科版",
 *                     "pid": "1244",
 *                     "code": "32",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1248",
 *                     "name": "中图版",
 *                     "pid": "1244",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1249",
 *                     "name": "山东版",
 *                     "pid": "1244",
 *                     "code": "104",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1250",
 *                     "name": "北师大版",
 *                     "pid": "1244",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1251",
 *                     "name": "苏教版2019",
 *                     "pid": "1244",
 *                     "code": "105",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1252",
 *                     "name": "北师大版2019",
 *                     "pid": "1244",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1253",
 *                 "name": "化学",
 *                 "pid": "1211",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1254",
 *                     "name": "人教版（2019）",
 *                     "pid": "1253",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1255",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1253",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1256",
 *                     "name": "苏教版",
 *                     "pid": "1253",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1257",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1253",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1258",
 *                     "name": "鲁科版",
 *                     "pid": "1253",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1259",
 *                     "name": "苏教版2019",
 *                     "pid": "1253",
 *                     "code": "105",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1260",
 *                 "name": "语文",
 *                 "pid": "1211",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1261",
 *                     "name": "部编版",
 *                     "pid": "1260",
 *                     "code": "81",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1262",
 *                     "name": "苏教版",
 *                     "pid": "1260",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1263",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1260",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1264",
 *                     "name": "粤教版",
 *                     "pid": "1260",
 *                     "code": "8",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1265",
 *                 "name": "政治",
 *                 "pid": "1211",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1266",
 *                     "name": "人教版",
 *                     "pid": "1265",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1267",
 *                     "name": "部编版",
 *                     "pid": "1265",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1268",
 *                 "name": "历史",
 *                 "pid": "1211",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1269",
 *                     "name": "北师大版",
 *                     "pid": "1268",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1270",
 *                     "name": "人民版",
 *                     "pid": "1268",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1271",
 *                     "name": "岳麓版",
 *                     "pid": "1268",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1272",
 *                     "name": "人教版",
 *                     "pid": "1268",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1273",
 *                 "name": "英语",
 *                 "pid": "1211",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1274",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1273",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1275",
 *                     "name": "外研衔接版",
 *                     "pid": "1273",
 *                     "code": "16",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1276",
 *                     "name": "北师大版",
 *                     "pid": "1273",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1277",
 *                     "name": "外研版（2019）",
 *                     "pid": "1273",
 *                     "code": "90",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1278",
 *                     "name": "人教版（2019）",
 *                     "pid": "1273",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1279",
 *                     "name": "重大版",
 *                     "pid": "1273",
 *                     "code": "126",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1280",
 *                     "name": "牛津译林版2019",
 *                     "pid": "1273",
 *                     "code": "136",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1281",
 *                     "name": "北师大版2019",
 *                     "pid": "1273",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1282",
 *             "name": "必修2",
 *             "pid": "1113",
 *             "code": "10200",
 *             "child": [
 *               {
 *                 "id": "1283",
 *                 "name": "地理",
 *                 "pid": "1282",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1284",
 *                     "name": "人教新版",
 *                     "pid": "1283",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1285",
 *                     "name": "人教版（2019）",
 *                     "pid": "1283",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1286",
 *                     "name": "湘教版",
 *                     "pid": "1283",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1287",
 *                     "name": "中图版",
 *                     "pid": "1283",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1288",
 *                     "name": "鲁教版",
 *                     "pid": "1283",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1289",
 *                     "name": "中图版2019",
 *                     "pid": "1283",
 *                     "code": "132",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1290",
 *                     "name": "鲁教版2019",
 *                     "pid": "1283",
 *                     "code": "133",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1291",
 *                     "name": "湘教版2019",
 *                     "pid": "1283",
 *                     "code": "135",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1292",
 *                 "name": "物理",
 *                 "pid": "1282",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1293",
 *                     "name": "人教版（2019）",
 *                     "pid": "1292",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1294",
 *                     "name": "粤教版",
 *                     "pid": "1292",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1295",
 *                     "name": "沪科版",
 *                     "pid": "1292",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1296",
 *                     "name": "鲁科版",
 *                     "pid": "1292",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1297",
 *                     "name": "教科版",
 *                     "pid": "1292",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1298",
 *                     "name": "教科版（2019）",
 *                     "pid": "1292",
 *                     "code": "89",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1299",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1292",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1300",
 *                     "name": "京教版",
 *                     "pid": "1292",
 *                     "code": "91",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1301",
 *                     "name": "人教版",
 *                     "pid": "1292",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1302",
 *                     "name": "粤教版2019",
 *                     "pid": "1292",
 *                     "code": "130",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1303",
 *                     "name": "沪科版2019",
 *                     "pid": "1292",
 *                     "code": "131",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1304",
 *                 "name": "数学",
 *                 "pid": "1282",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1305",
 *                     "name": "人教A新版",
 *                     "pid": "1304",
 *                     "code": "84",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1306",
 *                     "name": "北师大版",
 *                     "pid": "1304",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1307",
 *                     "name": "新课标人教B版",
 *                     "pid": "1304",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1308",
 *                     "name": "苏教版",
 *                     "pid": "1304",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1309",
 *                     "name": "湘教版",
 *                     "pid": "1304",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1310",
 *                     "name": "人教B新版",
 *                     "pid": "1304",
 *                     "code": "87",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1311",
 *                     "name": "新课标人教A版",
 *                     "pid": "1304",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1312",
 *                     "name": "北师大版2019",
 *                     "pid": "1304",
 *                     "code": "106",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1313",
 *                     "name": "苏教版2019",
 *                     "pid": "1304",
 *                     "code": "105",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1314",
 *                     "name": "沪教版2020",
 *                     "pid": "1304",
 *                     "code": "107",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1315",
 *                 "name": "政治",
 *                 "pid": "1282",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1316",
 *                     "name": "人教版",
 *                     "pid": "1315",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1317",
 *                     "name": "部编版",
 *                     "pid": "1315",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1318",
 *                 "name": "化学",
 *                 "pid": "1282",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1319",
 *                     "name": "苏教版",
 *                     "pid": "1318",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1320",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1318",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1321",
 *                     "name": "鲁科版",
 *                     "pid": "1318",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1322",
 *                     "name": "人教版（2019）",
 *                     "pid": "1318",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1323",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1318",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1324",
 *                     "name": "苏教版2019",
 *                     "pid": "1318",
 *                     "code": "105",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1325",
 *                 "name": "历史",
 *                 "pid": "1282",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1326",
 *                     "name": "北师大版",
 *                     "pid": "1325",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1327",
 *                     "name": "人民版",
 *                     "pid": "1325",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1328",
 *                     "name": "岳麓版",
 *                     "pid": "1325",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1329",
 *                     "name": "人教版",
 *                     "pid": "1325",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1330",
 *                 "name": "生物",
 *                 "pid": "1282",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1331",
 *                     "name": "人教版",
 *                     "pid": "1330",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1332",
 *                     "name": "苏教版",
 *                     "pid": "1330",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1333",
 *                     "name": "浙科版",
 *                     "pid": "1330",
 *                     "code": "32",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1334",
 *                     "name": "中图版",
 *                     "pid": "1330",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1335",
 *                     "name": "人教版（2019）",
 *                     "pid": "1330",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1336",
 *                     "name": "山东版",
 *                     "pid": "1330",
 *                     "code": "104",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1337",
 *                     "name": "北师大版",
 *                     "pid": "1330",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1338",
 *                     "name": "苏教版2019",
 *                     "pid": "1330",
 *                     "code": "105",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1339",
 *                     "name": "北师大版2019",
 *                     "pid": "1330",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1340",
 *                 "name": "英语",
 *                 "pid": "1282",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1341",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1340",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1342",
 *                     "name": "外研衔接版",
 *                     "pid": "1340",
 *                     "code": "16",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1343",
 *                     "name": "北师大版",
 *                     "pid": "1340",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1344",
 *                     "name": "外研版（2019）",
 *                     "pid": "1340",
 *                     "code": "90",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1345",
 *                     "name": "人教版（2019）",
 *                     "pid": "1340",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1346",
 *                     "name": "重大版",
 *                     "pid": "1340",
 *                     "code": "126",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1347",
 *                     "name": "牛津译林版2019",
 *                     "pid": "1340",
 *                     "code": "136",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1348",
 *                     "name": "北师大版2019",
 *                     "pid": "1340",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1349",
 *                 "name": "语文",
 *                 "pid": "1282",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1350",
 *                     "name": "苏教版",
 *                     "pid": "1349",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1351",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1349",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1352",
 *                     "name": "粤教版",
 *                     "pid": "1349",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1353",
 *                     "name": "部编版",
 *                     "pid": "1349",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1354",
 *             "name": "必修3",
 *             "pid": "1113",
 *             "code": "10300",
 *             "child": [
 *               {
 *                 "id": "1355",
 *                 "name": "地理",
 *                 "pid": "1354",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1356",
 *                     "name": "人教新版",
 *                     "pid": "1355",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1357",
 *                     "name": "湘教版",
 *                     "pid": "1355",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1358",
 *                     "name": "中图版",
 *                     "pid": "1355",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1359",
 *                     "name": "鲁教版",
 *                     "pid": "1355",
 *                     "code": "26",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1360",
 *                 "name": "物理",
 *                 "pid": "1354",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1361",
 *                     "name": "人教版（2019）",
 *                     "pid": "1360",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1362",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1360",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1363",
 *                     "name": "粤教版2019",
 *                     "pid": "1360",
 *                     "code": "130",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1364",
 *                     "name": "沪科版2019",
 *                     "pid": "1360",
 *                     "code": "131",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1365",
 *                     "name": "教科版（2019）",
 *                     "pid": "1360",
 *                     "code": "89",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1366",
 *                 "name": "数学",
 *                 "pid": "1354",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1367",
 *                     "name": "北师大版",
 *                     "pid": "1366",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1368",
 *                     "name": "新课标人教A版",
 *                     "pid": "1366",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1369",
 *                     "name": "新课标人教B版",
 *                     "pid": "1366",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1370",
 *                     "name": "苏教版",
 *                     "pid": "1366",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1371",
 *                     "name": "湘教版",
 *                     "pid": "1366",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1372",
 *                     "name": "人教B新版",
 *                     "pid": "1366",
 *                     "code": "87",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1373",
 *                 "name": "政治",
 *                 "pid": "1354",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1374",
 *                     "name": "人教版",
 *                     "pid": "1373",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1375",
 *                     "name": "部编版",
 *                     "pid": "1373",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1376",
 *                 "name": "历史",
 *                 "pid": "1354",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1377",
 *                     "name": "北师大版",
 *                     "pid": "1376",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1378",
 *                     "name": "人民版",
 *                     "pid": "1376",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1379",
 *                     "name": "岳麓版",
 *                     "pid": "1376",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1380",
 *                     "name": "人教版",
 *                     "pid": "1376",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1381",
 *                 "name": "生物",
 *                 "pid": "1354",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1382",
 *                     "name": "人教版",
 *                     "pid": "1381",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1383",
 *                     "name": "苏教版",
 *                     "pid": "1381",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1384",
 *                     "name": "浙科版",
 *                     "pid": "1381",
 *                     "code": "32",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1385",
 *                     "name": "中图版",
 *                     "pid": "1381",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1386",
 *                     "name": "山东版",
 *                     "pid": "1381",
 *                     "code": "104",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1387",
 *                     "name": "北师大版",
 *                     "pid": "1381",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1388",
 *                 "name": "英语",
 *                 "pid": "1354",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1389",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1388",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1390",
 *                     "name": "外研衔接版",
 *                     "pid": "1388",
 *                     "code": "16",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1391",
 *                     "name": "北师大版",
 *                     "pid": "1388",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1392",
 *                     "name": "外研版（2019）",
 *                     "pid": "1388",
 *                     "code": "90",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1393",
 *                     "name": "重大版",
 *                     "pid": "1388",
 *                     "code": "126",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1394",
 *                     "name": "牛津译林版2019",
 *                     "pid": "1388",
 *                     "code": "136",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1395",
 *                     "name": "人教版（2019）",
 *                     "pid": "1388",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1396",
 *                     "name": "北师大版2019",
 *                     "pid": "1388",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1397",
 *                 "name": "语文",
 *                 "pid": "1354",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1398",
 *                     "name": "苏教版",
 *                     "pid": "1397",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1399",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1397",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1400",
 *                     "name": "粤教版",
 *                     "pid": "1397",
 *                     "code": "8",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1401",
 *             "name": "必修4",
 *             "pid": "1113",
 *             "code": "10400",
 *             "child": [
 *               {
 *                 "id": "1402",
 *                 "name": "数学",
 *                 "pid": "1401",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1403",
 *                     "name": "北师大版",
 *                     "pid": "1402",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1404",
 *                     "name": "湘教版",
 *                     "pid": "1402",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1405",
 *                     "name": "新课标人教A版",
 *                     "pid": "1402",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1406",
 *                     "name": "新课标人教B版",
 *                     "pid": "1402",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1407",
 *                     "name": "苏教版",
 *                     "pid": "1402",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1408",
 *                     "name": "人教B新版",
 *                     "pid": "1402",
 *                     "code": "87",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1409",
 *                 "name": "政治",
 *                 "pid": "1401",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1410",
 *                     "name": "人教版",
 *                     "pid": "1409",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1411",
 *                     "name": "部编版",
 *                     "pid": "1409",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1412",
 *                 "name": "英语",
 *                 "pid": "1401",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1413",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1412",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1414",
 *                     "name": "外研衔接版",
 *                     "pid": "1412",
 *                     "code": "16",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1415",
 *                     "name": "北师大版",
 *                     "pid": "1412",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1416",
 *                     "name": "重大版",
 *                     "pid": "1412",
 *                     "code": "126",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1417",
 *                 "name": "语文",
 *                 "pid": "1401",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1418",
 *                     "name": "苏教版",
 *                     "pid": "1417",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1419",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1417",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1420",
 *                     "name": "粤教版",
 *                     "pid": "1417",
 *                     "code": "8",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1421",
 *             "name": "必修5",
 *             "pid": "1113",
 *             "code": "10500",
 *             "child": [
 *               {
 *                 "id": "1422",
 *                 "name": "数学",
 *                 "pid": "1421",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1423",
 *                     "name": "北师大版",
 *                     "pid": "1422",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1424",
 *                     "name": "湘教版",
 *                     "pid": "1422",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1425",
 *                     "name": "新课标人教A版",
 *                     "pid": "1422",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1426",
 *                     "name": "新课标人教B版",
 *                     "pid": "1422",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1427",
 *                     "name": "苏教版",
 *                     "pid": "1422",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1428",
 *                 "name": "英语",
 *                 "pid": "1421",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1429",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1428",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1430",
 *                     "name": "外研衔接版",
 *                     "pid": "1428",
 *                     "code": "16",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1431",
 *                     "name": "北师大版",
 *                     "pid": "1428",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1432",
 *                     "name": "重大版",
 *                     "pid": "1428",
 *                     "code": "126",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1433",
 *                 "name": "语文",
 *                 "pid": "1421",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1434",
 *                     "name": "苏教版",
 *                     "pid": "1433",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1435",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1433",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1436",
 *                     "name": "粤教版",
 *                     "pid": "1433",
 *                     "code": "8",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1437",
 *             "name": "选修1",
 *             "pid": "1113",
 *             "code": "20100",
 *             "child": [
 *               {
 *                 "id": "1438",
 *                 "name": "地理",
 *                 "pid": "1437",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1439",
 *                     "name": "人教新版",
 *                     "pid": "1438",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1440",
 *                     "name": "湘教版",
 *                     "pid": "1438",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1441",
 *                     "name": "鲁教版",
 *                     "pid": "1438",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1442",
 *                     "name": "中图版",
 *                     "pid": "1438",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1443",
 *                 "name": "政治",
 *                 "pid": "1437",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1444",
 *                     "name": "人教版",
 *                     "pid": "1443",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1445",
 *                 "name": "化学",
 *                 "pid": "1437",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1446",
 *                     "name": "苏教版",
 *                     "pid": "1445",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1447",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1445",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1448",
 *                     "name": "鲁科版",
 *                     "pid": "1445",
 *                     "code": "10",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1449",
 *                 "name": "历史",
 *                 "pid": "1437",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1450",
 *                     "name": "北师大版",
 *                     "pid": "1449",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1451",
 *                     "name": "人民版",
 *                     "pid": "1449",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1452",
 *                     "name": "岳麓版",
 *                     "pid": "1449",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1453",
 *                     "name": "人教版",
 *                     "pid": "1449",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1454",
 *                 "name": "生物",
 *                 "pid": "1437",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1455",
 *                     "name": "人教版",
 *                     "pid": "1454",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1456",
 *                     "name": "苏教版",
 *                     "pid": "1454",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1457",
 *                     "name": "浙科版",
 *                     "pid": "1454",
 *                     "code": "32",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1458",
 *                     "name": "中图版",
 *                     "pid": "1454",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1459",
 *                     "name": "人教版（2019）",
 *                     "pid": "1454",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1460",
 *                     "name": "山东版",
 *                     "pid": "1454",
 *                     "code": "104",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1461",
 *                     "name": "北师大版",
 *                     "pid": "1454",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1462",
 *             "name": "选修1-1",
 *             "pid": "1113",
 *             "code": "20101",
 *             "child": [
 *               {
 *                 "id": "1463",
 *                 "name": "数学",
 *                 "pid": "1462",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1464",
 *                     "name": "北师大版",
 *                     "pid": "1463",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1465",
 *                     "name": "湘教版",
 *                     "pid": "1463",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1466",
 *                     "name": "新课标人教A版",
 *                     "pid": "1463",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1467",
 *                     "name": "新课标人教B版",
 *                     "pid": "1463",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1468",
 *                     "name": "苏教版",
 *                     "pid": "1463",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1469",
 *                 "name": "物理",
 *                 "pid": "1462",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1470",
 *                     "name": "粤教版",
 *                     "pid": "1469",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1471",
 *                     "name": "沪科版",
 *                     "pid": "1469",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1472",
 *                     "name": "教科版",
 *                     "pid": "1469",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1473",
 *                     "name": "人教版",
 *                     "pid": "1469",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1474",
 *                     "name": "京教版",
 *                     "pid": "1469",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1475",
 *             "name": "选修1-2",
 *             "pid": "1113",
 *             "code": "20102",
 *             "child": [
 *               {
 *                 "id": "1476",
 *                 "name": "数学",
 *                 "pid": "1475",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1477",
 *                     "name": "北师大版",
 *                     "pid": "1476",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1478",
 *                     "name": "湘教版",
 *                     "pid": "1476",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1479",
 *                     "name": "新课标人教A版",
 *                     "pid": "1476",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1480",
 *                     "name": "新课标人教B版",
 *                     "pid": "1476",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1481",
 *                     "name": "苏教版",
 *                     "pid": "1476",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1482",
 *                 "name": "物理",
 *                 "pid": "1475",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1483",
 *                     "name": "粤教版",
 *                     "pid": "1482",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1484",
 *                     "name": "沪科版",
 *                     "pid": "1482",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1485",
 *                     "name": "人教版",
 *                     "pid": "1482",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1486",
 *                     "name": "京教版",
 *                     "pid": "1482",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1487",
 *             "name": "选修2",
 *             "pid": "1113",
 *             "code": "20200",
 *             "child": [
 *               {
 *                 "id": "1488",
 *                 "name": "地理",
 *                 "pid": "1487",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1489",
 *                     "name": "人教新版",
 *                     "pid": "1488",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1490",
 *                     "name": "湘教版",
 *                     "pid": "1488",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1491",
 *                     "name": "鲁教版",
 *                     "pid": "1488",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1492",
 *                     "name": "中图版",
 *                     "pid": "1488",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1493",
 *                 "name": "政治",
 *                 "pid": "1487",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1494",
 *                     "name": "人教版",
 *                     "pid": "1493",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1495",
 *                 "name": "化学",
 *                 "pid": "1487",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1496",
 *                     "name": "苏教版",
 *                     "pid": "1495",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1497",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1495",
 *                     "code": "40",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1498",
 *                 "name": "历史",
 *                 "pid": "1487",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1499",
 *                     "name": "北师大版",
 *                     "pid": "1498",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1500",
 *                     "name": "人民版",
 *                     "pid": "1498",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1501",
 *                     "name": "岳麓版",
 *                     "pid": "1498",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1502",
 *                     "name": "人教版",
 *                     "pid": "1498",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1503",
 *                 "name": "生物",
 *                 "pid": "1487",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1504",
 *                     "name": "人教版",
 *                     "pid": "1503",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1505",
 *                     "name": "苏教版",
 *                     "pid": "1503",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1506",
 *                     "name": "浙科版",
 *                     "pid": "1503",
 *                     "code": "32",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1507",
 *                     "name": "中图版",
 *                     "pid": "1503",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1508",
 *                     "name": "山东版",
 *                     "pid": "1503",
 *                     "code": "104",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1509",
 *                     "name": "北师大版",
 *                     "pid": "1503",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1510",
 *                     "name": "人教版（2019）",
 *                     "pid": "1503",
 *                     "code": "85",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1511",
 *             "name": "选修2-1",
 *             "pid": "1113",
 *             "code": "20201",
 *             "child": [
 *               {
 *                 "id": "1512",
 *                 "name": "数学",
 *                 "pid": "1511",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1513",
 *                     "name": "北师大版",
 *                     "pid": "1512",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1514",
 *                     "name": "湘教版",
 *                     "pid": "1512",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1515",
 *                     "name": "新课标人教A版",
 *                     "pid": "1512",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1516",
 *                     "name": "新课标人教B版",
 *                     "pid": "1512",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1517",
 *                     "name": "苏教版",
 *                     "pid": "1512",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1518",
 *                 "name": "物理",
 *                 "pid": "1511",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1519",
 *                     "name": "粤教版",
 *                     "pid": "1518",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1520",
 *                     "name": "沪科版",
 *                     "pid": "1518",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1521",
 *                     "name": "人教版",
 *                     "pid": "1518",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1522",
 *                     "name": "京教版",
 *                     "pid": "1518",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1523",
 *             "name": "选修2-2",
 *             "pid": "1113",
 *             "code": "20202",
 *             "child": [
 *               {
 *                 "id": "1524",
 *                 "name": "数学",
 *                 "pid": "1523",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1525",
 *                     "name": "北师大版",
 *                     "pid": "1524",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1526",
 *                     "name": "湘教版",
 *                     "pid": "1524",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1527",
 *                     "name": "新课标人教A版",
 *                     "pid": "1524",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1528",
 *                     "name": "新课标人教B版",
 *                     "pid": "1524",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1529",
 *                     "name": "苏教版",
 *                     "pid": "1524",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1530",
 *                 "name": "物理",
 *                 "pid": "1523",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1531",
 *                     "name": "粤教版",
 *                     "pid": "1530",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1532",
 *                     "name": "沪科版",
 *                     "pid": "1530",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1533",
 *                     "name": "人教版",
 *                     "pid": "1530",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1534",
 *                     "name": "京教版",
 *                     "pid": "1530",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1535",
 *             "name": "选修2-3",
 *             "pid": "1113",
 *             "code": "20203",
 *             "child": [
 *               {
 *                 "id": "1536",
 *                 "name": "数学",
 *                 "pid": "1535",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1537",
 *                     "name": "北师大版",
 *                     "pid": "1536",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1538",
 *                     "name": "湘教版",
 *                     "pid": "1536",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1539",
 *                     "name": "新课标人教A版",
 *                     "pid": "1536",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1540",
 *                     "name": "新课标人教B版",
 *                     "pid": "1536",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1541",
 *                     "name": "苏教版",
 *                     "pid": "1536",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1542",
 *                 "name": "物理",
 *                 "pid": "1535",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1543",
 *                     "name": "粤教版",
 *                     "pid": "1542",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1544",
 *                     "name": "沪科版",
 *                     "pid": "1542",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1545",
 *                     "name": "人教版",
 *                     "pid": "1542",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1546",
 *                     "name": "京教版",
 *                     "pid": "1542",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1547",
 *             "name": "选修3",
 *             "pid": "1113",
 *             "code": "20300",
 *             "child": [
 *               {
 *                 "id": "1548",
 *                 "name": "地理",
 *                 "pid": "1547",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1549",
 *                     "name": "人教新版",
 *                     "pid": "1548",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1550",
 *                     "name": "湘教版",
 *                     "pid": "1548",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1551",
 *                     "name": "鲁教版",
 *                     "pid": "1548",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1552",
 *                     "name": "中图版",
 *                     "pid": "1548",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1553",
 *                 "name": "政治",
 *                 "pid": "1547",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1554",
 *                     "name": "人教版",
 *                     "pid": "1553",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1555",
 *                 "name": "化学",
 *                 "pid": "1547",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1556",
 *                     "name": "苏教版",
 *                     "pid": "1555",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1557",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1555",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1558",
 *                     "name": "鲁科版",
 *                     "pid": "1555",
 *                     "code": "10",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1559",
 *                 "name": "历史",
 *                 "pid": "1547",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1560",
 *                     "name": "北师大版",
 *                     "pid": "1559",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1561",
 *                     "name": "人民版",
 *                     "pid": "1559",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1562",
 *                     "name": "岳麓版",
 *                     "pid": "1559",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1563",
 *                     "name": "人教版",
 *                     "pid": "1559",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1564",
 *                 "name": "生物",
 *                 "pid": "1547",
 *                 "code": "7",
 *                 "child": [
 *                   {
 *                     "id": "1565",
 *                     "name": "人教版",
 *                     "pid": "1564",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1566",
 *                     "name": "苏教版",
 *                     "pid": "1564",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1567",
 *                     "name": "浙科版",
 *                     "pid": "1564",
 *                     "code": "32",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1568",
 *                     "name": "中图版",
 *                     "pid": "1564",
 *                     "code": "23",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1569",
 *                     "name": "山东版",
 *                     "pid": "1564",
 *                     "code": "104",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1570",
 *                     "name": "北师大版",
 *                     "pid": "1564",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1571",
 *                     "name": "人教版（2019）",
 *                     "pid": "1564",
 *                     "code": "85",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1572",
 *             "name": "选修3-1",
 *             "pid": "1113",
 *             "code": "20301",
 *             "child": [
 *               {
 *                 "id": "1573",
 *                 "name": "物理",
 *                 "pid": "1572",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1574",
 *                     "name": "粤教版",
 *                     "pid": "1573",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1575",
 *                     "name": "鲁科版",
 *                     "pid": "1573",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1576",
 *                     "name": "沪科版",
 *                     "pid": "1573",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1577",
 *                     "name": "教科版",
 *                     "pid": "1573",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1578",
 *                     "name": "人教版",
 *                     "pid": "1573",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1579",
 *                     "name": "京教版",
 *                     "pid": "1573",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1580",
 *                 "name": "数学",
 *                 "pid": "1572",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1581",
 *                     "name": "新课标人教A版",
 *                     "pid": "1580",
 *                     "code": "6",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1582",
 *             "name": "选修3-2",
 *             "pid": "1113",
 *             "code": "20302",
 *             "child": [
 *               {
 *                 "id": "1583",
 *                 "name": "物理",
 *                 "pid": "1582",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1584",
 *                     "name": "粤教版",
 *                     "pid": "1583",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1585",
 *                     "name": "鲁科版",
 *                     "pid": "1583",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1586",
 *                     "name": "沪科版",
 *                     "pid": "1583",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1587",
 *                     "name": "教科版",
 *                     "pid": "1583",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1588",
 *                     "name": "人教版",
 *                     "pid": "1583",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1589",
 *                     "name": "京教版",
 *                     "pid": "1583",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1590",
 *             "name": "选修3-3",
 *             "pid": "1113",
 *             "code": "20303",
 *             "child": [
 *               {
 *                 "id": "1591",
 *                 "name": "数学",
 *                 "pid": "1590",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1592",
 *                     "name": "苏教版",
 *                     "pid": "1591",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1593",
 *                     "name": "新课标人教A版",
 *                     "pid": "1591",
 *                     "code": "6",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1594",
 *                 "name": "物理",
 *                 "pid": "1590",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1595",
 *                     "name": "粤教版",
 *                     "pid": "1594",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1596",
 *                     "name": "鲁科版",
 *                     "pid": "1594",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1597",
 *                     "name": "沪科版",
 *                     "pid": "1594",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1598",
 *                     "name": "教科版",
 *                     "pid": "1594",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1599",
 *                     "name": "人教版",
 *                     "pid": "1594",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1600",
 *                     "name": "京教版",
 *                     "pid": "1594",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1601",
 *             "name": "选修3-4",
 *             "pid": "1113",
 *             "code": "20304",
 *             "child": [
 *               {
 *                 "id": "1602",
 *                 "name": "物理",
 *                 "pid": "1601",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1603",
 *                     "name": "粤教版",
 *                     "pid": "1602",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1604",
 *                     "name": "鲁科版",
 *                     "pid": "1602",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1605",
 *                     "name": "沪科版",
 *                     "pid": "1602",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1606",
 *                     "name": "教科版",
 *                     "pid": "1602",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1607",
 *                     "name": "人教版",
 *                     "pid": "1602",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1608",
 *                     "name": "京教版",
 *                     "pid": "1602",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1609",
 *                 "name": "数学",
 *                 "pid": "1601",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1610",
 *                     "name": "新课标人教A版",
 *                     "pid": "1609",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1611",
 *                     "name": "苏教版",
 *                     "pid": "1609",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1612",
 *             "name": "选修3-5",
 *             "pid": "1113",
 *             "code": "20305",
 *             "child": [
 *               {
 *                 "id": "1613",
 *                 "name": "物理",
 *                 "pid": "1612",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1614",
 *                     "name": "粤教版",
 *                     "pid": "1613",
 *                     "code": "8",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1615",
 *                     "name": "鲁科版",
 *                     "pid": "1613",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1616",
 *                     "name": "教科版",
 *                     "pid": "1613",
 *                     "code": "30",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1617",
 *                     "name": "人教版",
 *                     "pid": "1613",
 *                     "code": "1",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1618",
 *                     "name": "沪科版",
 *                     "pid": "1613",
 *                     "code": "9",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1619",
 *                     "name": "京教版",
 *                     "pid": "1613",
 *                     "code": "91",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1620",
 *             "name": "选修4",
 *             "pid": "1113",
 *             "code": "20400",
 *             "child": [
 *               {
 *                 "id": "1621",
 *                 "name": "地理",
 *                 "pid": "1620",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1622",
 *                     "name": "人教新版",
 *                     "pid": "1621",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1623",
 *                     "name": "湘教版",
 *                     "pid": "1621",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1624",
 *                     "name": "鲁教版",
 *                     "pid": "1621",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1625",
 *                     "name": "中图版",
 *                     "pid": "1621",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1626",
 *                 "name": "政治",
 *                 "pid": "1620",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1627",
 *                     "name": "人教版",
 *                     "pid": "1626",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1628",
 *                 "name": "化学",
 *                 "pid": "1620",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1629",
 *                     "name": "苏教版",
 *                     "pid": "1628",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1630",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1628",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1631",
 *                     "name": "鲁科版",
 *                     "pid": "1628",
 *                     "code": "10",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1632",
 *                 "name": "历史",
 *                 "pid": "1620",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1633",
 *                     "name": "北师大版",
 *                     "pid": "1632",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1634",
 *                     "name": "人民版",
 *                     "pid": "1632",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1635",
 *                     "name": "岳麓版",
 *                     "pid": "1632",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1636",
 *                     "name": "人教版",
 *                     "pid": "1632",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1637",
 *             "name": "选修4-1",
 *             "pid": "1113",
 *             "code": "20401",
 *             "child": [
 *               {
 *                 "id": "1638",
 *                 "name": "数学",
 *                 "pid": "1637",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1639",
 *                     "name": "北师大版",
 *                     "pid": "1638",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1640",
 *                     "name": "新课标人教A版",
 *                     "pid": "1638",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1641",
 *                     "name": "苏教版",
 *                     "pid": "1638",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1642",
 *             "name": "选修4-2",
 *             "pid": "1113",
 *             "code": "20402",
 *             "child": [
 *               {
 *                 "id": "1643",
 *                 "name": "数学",
 *                 "pid": "1642",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1644",
 *                     "name": "北师大版",
 *                     "pid": "1643",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1645",
 *                     "name": "新课标人教A版",
 *                     "pid": "1643",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1646",
 *                     "name": "苏教版",
 *                     "pid": "1643",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1647",
 *             "name": "选修4-4",
 *             "pid": "1113",
 *             "code": "20404",
 *             "child": [
 *               {
 *                 "id": "1648",
 *                 "name": "数学",
 *                 "pid": "1647",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1649",
 *                     "name": "北师大版",
 *                     "pid": "1648",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1650",
 *                     "name": "新课标人教A版",
 *                     "pid": "1648",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1651",
 *                     "name": "苏教版",
 *                     "pid": "1648",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1652",
 *             "name": "选修4-5",
 *             "pid": "1113",
 *             "code": "20405",
 *             "child": [
 *               {
 *                 "id": "1653",
 *                 "name": "数学",
 *                 "pid": "1652",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1654",
 *                     "name": "北师大版",
 *                     "pid": "1653",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1655",
 *                     "name": "新课标人教A版",
 *                     "pid": "1653",
 *                     "code": "6",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1656",
 *                     "name": "新课标人教B版",
 *                     "pid": "1653",
 *                     "code": "7",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1657",
 *                     "name": "苏教版",
 *                     "pid": "1653",
 *                     "code": "3",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1658",
 *             "name": "选修4-6",
 *             "pid": "1113",
 *             "code": "20406",
 *             "child": [
 *               {
 *                 "id": "1659",
 *                 "name": "数学",
 *                 "pid": "1658",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1660",
 *                     "name": "北师大版",
 *                     "pid": "1659",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1661",
 *                     "name": "新课标人教A版",
 *                     "pid": "1659",
 *                     "code": "6",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1662",
 *             "name": "选修4-7",
 *             "pid": "1113",
 *             "code": "20407",
 *             "child": [
 *               {
 *                 "id": "1663",
 *                 "name": "数学",
 *                 "pid": "1662",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1664",
 *                     "name": "北师大版",
 *                     "pid": "1663",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1665",
 *                     "name": "新课标人教A版",
 *                     "pid": "1663",
 *                     "code": "6",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1666",
 *             "name": "选修5",
 *             "pid": "1113",
 *             "code": "20500",
 *             "child": [
 *               {
 *                 "id": "1667",
 *                 "name": "地理",
 *                 "pid": "1666",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1668",
 *                     "name": "人教新版",
 *                     "pid": "1667",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1669",
 *                     "name": "湘教版",
 *                     "pid": "1667",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1670",
 *                     "name": "鲁教版",
 *                     "pid": "1667",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1671",
 *                     "name": "中图版",
 *                     "pid": "1667",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1672",
 *                 "name": "政治",
 *                 "pid": "1666",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1673",
 *                     "name": "人教版",
 *                     "pid": "1672",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1674",
 *                 "name": "化学",
 *                 "pid": "1666",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1675",
 *                     "name": "苏教版",
 *                     "pid": "1674",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1676",
 *                     "name": "鲁科版",
 *                     "pid": "1674",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1677",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1674",
 *                     "code": "40",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1678",
 *                 "name": "历史",
 *                 "pid": "1666",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1679",
 *                     "name": "北师大版",
 *                     "pid": "1678",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1680",
 *                     "name": "人民版",
 *                     "pid": "1678",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1681",
 *                     "name": "岳麓版",
 *                     "pid": "1678",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1682",
 *                     "name": "人教版",
 *                     "pid": "1678",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1683",
 *             "name": "选修6",
 *             "pid": "1113",
 *             "code": "20600",
 *             "child": [
 *               {
 *                 "id": "1684",
 *                 "name": "地理",
 *                 "pid": "1683",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1685",
 *                     "name": "人教新版",
 *                     "pid": "1684",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1686",
 *                     "name": "湘教版",
 *                     "pid": "1684",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1687",
 *                     "name": "鲁教版",
 *                     "pid": "1684",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1688",
 *                     "name": "中图版",
 *                     "pid": "1684",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1689",
 *                 "name": "政治",
 *                 "pid": "1683",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1690",
 *                     "name": "人教版",
 *                     "pid": "1689",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1691",
 *                 "name": "化学",
 *                 "pid": "1683",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1692",
 *                     "name": "苏教版",
 *                     "pid": "1691",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1693",
 *                     "name": "鲁科版",
 *                     "pid": "1691",
 *                     "code": "10",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1694",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1691",
 *                     "code": "40",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1695",
 *                 "name": "历史",
 *                 "pid": "1683",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1696",
 *                     "name": "北师大版",
 *                     "pid": "1695",
 *                     "code": "4",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1697",
 *                     "name": "人民版",
 *                     "pid": "1695",
 *                     "code": "33",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1698",
 *                     "name": "岳麓版",
 *                     "pid": "1695",
 *                     "code": "34",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1699",
 *                     "name": "人教版",
 *                     "pid": "1695",
 *                     "code": "1",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1700",
 *                 "name": "英语",
 *                 "pid": "1683",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1701",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1700",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1702",
 *                     "name": "外研版",
 *                     "pid": "1700",
 *                     "code": "121",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1703",
 *                     "name": "北师大版",
 *                     "pid": "1700",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1704",
 *             "name": "选修7",
 *             "pid": "1113",
 *             "code": "20700",
 *             "child": [
 *               {
 *                 "id": "1705",
 *                 "name": "地理",
 *                 "pid": "1704",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1706",
 *                     "name": "人教新版",
 *                     "pid": "1705",
 *                     "code": "59",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1707",
 *                     "name": "湘教版",
 *                     "pid": "1705",
 *                     "code": "11",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1708",
 *                     "name": "鲁教版",
 *                     "pid": "1705",
 *                     "code": "26",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1709",
 *                     "name": "中图版",
 *                     "pid": "1705",
 *                     "code": "23",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1710",
 *                 "name": "英语",
 *                 "pid": "1704",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1711",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1710",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1712",
 *                     "name": "外研版",
 *                     "pid": "1710",
 *                     "code": "121",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1713",
 *                     "name": "北师大版",
 *                     "pid": "1710",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1714",
 *             "name": "选修8",
 *             "pid": "1113",
 *             "code": "20800",
 *             "child": [
 *               {
 *                 "id": "1715",
 *                 "name": "英语",
 *                 "pid": "1714",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1716",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1715",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1717",
 *                     "name": "外研版",
 *                     "pid": "1715",
 *                     "code": "121",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1718",
 *                     "name": "北师大版",
 *                     "pid": "1715",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1719",
 *             "name": "选修",
 *             "pid": "1113",
 *             "code": "20900",
 *             "child": [
 *               {
 *                 "id": "1720",
 *                 "name": "语文",
 *                 "pid": "1719",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1721",
 *                     "name": "苏教版",
 *                     "pid": "1720",
 *                     "code": "3",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1722",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1720",
 *                     "code": "40",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1723",
 *             "name": "选修10",
 *             "pid": "1113",
 *             "code": "21000",
 *             "child": [
 *               {
 *                 "id": "1724",
 *                 "name": "英语",
 *                 "pid": "1723",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1725",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1724",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1726",
 *                     "name": "外研版",
 *                     "pid": "1724",
 *                     "code": "121",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1727",
 *                     "name": "北师大版",
 *                     "pid": "1724",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1728",
 *             "name": "选修11",
 *             "pid": "1113",
 *             "code": "21100",
 *             "child": [
 *               {
 *                 "id": "1729",
 *                 "name": "英语",
 *                 "pid": "1728",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1730",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1729",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1731",
 *                     "name": "外研版",
 *                     "pid": "1729",
 *                     "code": "121",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1732",
 *                     "name": "北师大版",
 *                     "pid": "1729",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1733",
 *             "name": "选修9",
 *             "pid": "1113",
 *             "code": "29000",
 *             "child": [
 *               {
 *                 "id": "1734",
 *                 "name": "英语",
 *                 "pid": "1733",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1735",
 *                     "name": "人教版（新课程标准）",
 *                     "pid": "1734",
 *                     "code": "40",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1736",
 *                     "name": "外研版",
 *                     "pid": "1734",
 *                     "code": "121",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1737",
 *                     "name": "北师大版",
 *                     "pid": "1734",
 *                     "code": "4",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1738",
 *             "name": "选择性必修1",
 *             "pid": "1113",
 *             "code": "30100",
 *             "child": [
 *               {
 *                 "id": "1739",
 *                 "name": "物理",
 *                 "pid": "1738",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1740",
 *                     "name": "人教版（2019）",
 *                     "pid": "1739",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1741",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1739",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1742",
 *                     "name": "粤教版2019",
 *                     "pid": "1739",
 *                     "code": "130",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1743",
 *                     "name": "沪科版2019",
 *                     "pid": "1739",
 *                     "code": "131",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1744",
 *                     "name": "教科版（2019）",
 *                     "pid": "1739",
 *                     "code": "89",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1745",
 *                 "name": "数学",
 *                 "pid": "1738",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1746",
 *                     "name": "人教A新版",
 *                     "pid": "1745",
 *                     "code": "84",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1747",
 *                     "name": "人教B新版",
 *                     "pid": "1745",
 *                     "code": "87",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1748",
 *                     "name": "北师大版2019",
 *                     "pid": "1745",
 *                     "code": "106",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1749",
 *                     "name": "苏教版2019",
 *                     "pid": "1745",
 *                     "code": "105",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1750",
 *                 "name": "政治",
 *                 "pid": "1738",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1751",
 *                     "name": "部编版",
 *                     "pid": "1750",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1752",
 *                 "name": "历史",
 *                 "pid": "1738",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1753",
 *                     "name": "部编版",
 *                     "pid": "1752",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1754",
 *                 "name": "语文",
 *                 "pid": "1738",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1755",
 *                     "name": "部编版",
 *                     "pid": "1754",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1756",
 *                 "name": "英语",
 *                 "pid": "1738",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1757",
 *                     "name": "人教版（2019）",
 *                     "pid": "1756",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1758",
 *                     "name": "外研版（2019）",
 *                     "pid": "1756",
 *                     "code": "90",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1759",
 *                     "name": "牛津译林版2019",
 *                     "pid": "1756",
 *                     "code": "136",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1760",
 *                     "name": "北师大版2019",
 *                     "pid": "1756",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1761",
 *                 "name": "化学",
 *                 "pid": "1738",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1762",
 *                     "name": "人教版（2019）",
 *                     "pid": "1761",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1763",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1761",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1764",
 *                     "name": "苏教版2019",
 *                     "pid": "1761",
 *                     "code": "105",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1765",
 *                 "name": "地理",
 *                 "pid": "1738",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1766",
 *                     "name": "人教版（2019）",
 *                     "pid": "1765",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1767",
 *                     "name": "中图版2019",
 *                     "pid": "1765",
 *                     "code": "132",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1768",
 *                     "name": "鲁教版2019",
 *                     "pid": "1765",
 *                     "code": "133",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1769",
 *                     "name": "湘教版2019",
 *                     "pid": "1765",
 *                     "code": "135",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1770",
 *             "name": "选择性必修2",
 *             "pid": "1113",
 *             "code": "30200",
 *             "child": [
 *               {
 *                 "id": "1771",
 *                 "name": "物理",
 *                 "pid": "1770",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1772",
 *                     "name": "人教版（2019）",
 *                     "pid": "1771",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1773",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1771",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1774",
 *                     "name": "粤教版2019",
 *                     "pid": "1771",
 *                     "code": "130",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1775",
 *                     "name": "沪科版2019",
 *                     "pid": "1771",
 *                     "code": "131",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1776",
 *                     "name": "教科版（2019）",
 *                     "pid": "1771",
 *                     "code": "89",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1777",
 *                 "name": "数学",
 *                 "pid": "1770",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1778",
 *                     "name": "人教A新版",
 *                     "pid": "1777",
 *                     "code": "84",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1779",
 *                     "name": "人教B新版",
 *                     "pid": "1777",
 *                     "code": "87",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1780",
 *                     "name": "北师大版2019",
 *                     "pid": "1777",
 *                     "code": "106",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1781",
 *                     "name": "苏教版2019",
 *                     "pid": "1777",
 *                     "code": "105",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1782",
 *                 "name": "语文",
 *                 "pid": "1770",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1783",
 *                     "name": "部编版",
 *                     "pid": "1782",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1784",
 *                 "name": "英语",
 *                 "pid": "1770",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1785",
 *                     "name": "人教版（2019）",
 *                     "pid": "1784",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1786",
 *                     "name": "外研版（2019）",
 *                     "pid": "1784",
 *                     "code": "90",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1787",
 *                     "name": "北师大版2019",
 *                     "pid": "1784",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1788",
 *                 "name": "化学",
 *                 "pid": "1770",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1789",
 *                     "name": "人教版（2019）",
 *                     "pid": "1788",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1790",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1788",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1791",
 *                     "name": "苏教版2019",
 *                     "pid": "1788",
 *                     "code": "105",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1792",
 *                 "name": "政治",
 *                 "pid": "1770",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1793",
 *                     "name": "部编版",
 *                     "pid": "1792",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1794",
 *                 "name": "地理",
 *                 "pid": "1770",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1795",
 *                     "name": "人教版（2019）",
 *                     "pid": "1794",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1796",
 *                     "name": "中图版2019",
 *                     "pid": "1794",
 *                     "code": "132",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1797",
 *                     "name": "鲁教版2019",
 *                     "pid": "1794",
 *                     "code": "133",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1798",
 *                     "name": "湘教版2019",
 *                     "pid": "1794",
 *                     "code": "135",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1799",
 *                 "name": "历史",
 *                 "pid": "1770",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1800",
 *                     "name": "部编版",
 *                     "pid": "1799",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1801",
 *             "name": "选择性必修3",
 *             "pid": "1113",
 *             "code": "30300",
 *             "child": [
 *               {
 *                 "id": "1802",
 *                 "name": "物理",
 *                 "pid": "1801",
 *                 "code": "8",
 *                 "child": [
 *                   {
 *                     "id": "1803",
 *                     "name": "人教版（2019）",
 *                     "pid": "1802",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1804",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1802",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1805",
 *                     "name": "粤教版2019",
 *                     "pid": "1802",
 *                     "code": "130",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1806",
 *                     "name": "沪科版2019",
 *                     "pid": "1802",
 *                     "code": "131",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1807",
 *                     "name": "教科版（2019）",
 *                     "pid": "1802",
 *                     "code": "89",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1808",
 *                 "name": "数学",
 *                 "pid": "1801",
 *                 "code": "2",
 *                 "child": [
 *                   {
 *                     "id": "1809",
 *                     "name": "人教A新版",
 *                     "pid": "1808",
 *                     "code": "84",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1810",
 *                     "name": "人教B新版",
 *                     "pid": "1808",
 *                     "code": "87",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1811",
 *                 "name": "语文",
 *                 "pid": "1801",
 *                 "code": "1",
 *                 "child": [
 *                   {
 *                     "id": "1812",
 *                     "name": "部编版",
 *                     "pid": "1811",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1813",
 *                 "name": "英语",
 *                 "pid": "1801",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1814",
 *                     "name": "外研版（2019）",
 *                     "pid": "1813",
 *                     "code": "90",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1815",
 *                     "name": "人教版（2019）",
 *                     "pid": "1813",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1816",
 *                     "name": "北师大版2019",
 *                     "pid": "1813",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1817",
 *                 "name": "化学",
 *                 "pid": "1801",
 *                 "code": "9",
 *                 "child": [
 *                   {
 *                     "id": "1818",
 *                     "name": "人教版（2019）",
 *                     "pid": "1817",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1819",
 *                     "name": "鲁科版（2019）",
 *                     "pid": "1817",
 *                     "code": "86",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1820",
 *                     "name": "苏教版2019",
 *                     "pid": "1817",
 *                     "code": "105",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1821",
 *                 "name": "政治",
 *                 "pid": "1801",
 *                 "code": "6",
 *                 "child": [
 *                   {
 *                     "id": "1822",
 *                     "name": "部编版",
 *                     "pid": "1821",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1823",
 *                 "name": "地理",
 *                 "pid": "1801",
 *                 "code": "5",
 *                 "child": [
 *                   {
 *                     "id": "1824",
 *                     "name": "人教版（2019）",
 *                     "pid": "1823",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1825",
 *                     "name": "中图版2019",
 *                     "pid": "1823",
 *                     "code": "132",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1826",
 *                     "name": "鲁教版2019",
 *                     "pid": "1823",
 *                     "code": "133",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1827",
 *                     "name": "湘教版2019",
 *                     "pid": "1823",
 *                     "code": "135",
 *                     "child": []
 *                   }
 *                 ]
 *               },
 *               {
 *                 "id": "1828",
 *                 "name": "历史",
 *                 "pid": "1801",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1829",
 *                     "name": "部编版",
 *                     "pid": "1828",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1830",
 *             "name": "选择性必修4",
 *             "pid": "1113",
 *             "code": "30400",
 *             "child": [
 *               {
 *                 "id": "1831",
 *                 "name": "英语",
 *                 "pid": "1830",
 *                 "code": "3",
 *                 "child": [
 *                   {
 *                     "id": "1832",
 *                     "name": "人教版（2019）",
 *                     "pid": "1831",
 *                     "code": "85",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1833",
 *                     "name": "外研版（2019）",
 *                     "pid": "1831",
 *                     "code": "90",
 *                     "child": []
 *                   },
 *                   {
 *                     "id": "1834",
 *                     "name": "北师大版2019",
 *                     "pid": "1831",
 *                     "code": "106",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1835",
 *             "name": "必修 中外历史纲要上",
 *             "pid": "1113",
 *             "code": "40101",
 *             "child": [
 *               {
 *                 "id": "1836",
 *                 "name": "历史",
 *                 "pid": "1835",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1837",
 *                     "name": "部编版",
 *                     "pid": "1836",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           },
 *           {
 *             "id": "1838",
 *             "name": "必修 中外历史纲要下",
 *             "pid": "1113",
 *             "code": "40102",
 *             "child": [
 *               {
 *                 "id": "1839",
 *                 "name": "历史",
 *                 "pid": "1838",
 *                 "code": "4",
 *                 "child": [
 *                   {
 *                     "id": "1840",
 *                     "name": "部编版",
 *                     "pid": "1839",
 *                     "code": "81",
 *                     "child": []
 *                   }
 *                 ]
 *               }
 *             ]
 *           }
 *         ]
 *       }
 *     ],
 *     "cache": "0"
 *   }”
 */